sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
/*!
    \file    gd32a7xx_timer.c
    \brief   TIMER driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_timer.h"
#include <stdlib.h>


/* TIMER init parameter mask */
#define ALIGNEDMODE_MASK            ((uint32_t)0x00000060U)     /*!< TIMER init parameter aligne dmode mask */
#define COUNTERDIRECTION_MASK       ((uint32_t)0x00000010U)     /*!< TIMER init parameter counter direction mask */
#define CLOCKDIVISION_MASK          ((uint32_t)0x00000300U)     /*!< TIMER init parameter clock division value mask */

/*!
    \brief      deinit a TIMER (API_ID(0x0001U))
    \param[in]  timer_periph: TIMERx(x=0~2,5~7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_deinit(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0001U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(timer_periph) {
        case TIMER0:
            /* reset TIMER0 */
            timer_disable(TIMER0);
            rcu_periph_reset_enable(RCU_TIMER0RST);
            rcu_periph_reset_disable(RCU_TIMER0RST);
            break;
        case TIMER1:
            /* reset TIMER1 */
            timer_disable(TIMER1);
            rcu_periph_reset_enable(RCU_TIMER1RST);
            rcu_periph_reset_disable(RCU_TIMER1RST);
            break;
        case TIMER2:
            /* reset TIMER2 */
            timer_disable(TIMER2);
            rcu_periph_reset_enable(RCU_TIMER2RST);
            rcu_periph_reset_disable(RCU_TIMER2RST);
            break;
        case TIMER5:
            /* reset TIMER5 */
            timer_disable(TIMER5);
            rcu_periph_reset_enable(RCU_TIMER5RST);
            rcu_periph_reset_disable(RCU_TIMER5RST);
            break;
        case TIMER6:
            /* reset TIMER6 */
            timer_disable(TIMER6);
            rcu_periph_reset_enable(RCU_TIMER6RST);
            rcu_periph_reset_disable(RCU_TIMER6RST);
            break;
        case TIMER7:
            /* reset TIMER7 */
            timer_disable(TIMER7);
            rcu_periph_reset_enable(RCU_TIMER7RST);
            rcu_periph_reset_disable(RCU_TIMER7RST);
            break;
        case TIMER19:
            /* reset TIMER19 */
            timer_disable(TIMER19);
            rcu_periph_reset_enable(RCU_TIMER19RST);
            rcu_periph_reset_disable(RCU_TIMER19RST);
            break;
        case TIMER20:
            /* reset TIMER20 */
            timer_disable(TIMER20);
            rcu_periph_reset_enable(RCU_TIMER20RST);
            rcu_periph_reset_disable(RCU_TIMER20RST);
            break;
        case TIMER60:
            /* reset TIMER60 */
            timer_disable(TIMER60);
            rcu_periph_reset_enable(RCU_TIMER60RST);
            rcu_periph_reset_disable(RCU_TIMER60RST);
            break;
        case TIMER61:
            /* reset TIMER61 */
            timer_disable(TIMER61);
            rcu_periph_reset_enable(RCU_TIMER61RST);
            rcu_periph_reset_disable(RCU_TIMER61RST);
            break;
        case TIMER62:
            /* reset TIMER62 */
            timer_disable(TIMER62);
            rcu_periph_reset_enable(RCU_TIMER62RST);
            rcu_periph_reset_disable(RCU_TIMER62RST);
            break;
        case TIMER63:
            /* reset TIMER63 */
            timer_disable(TIMER63);
            rcu_periph_reset_enable(RCU_TIMER63RST);
            rcu_periph_reset_disable(RCU_TIMER63RST);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      initialize TIMER init parameter struct with a default value (API_ID(0x0002U))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void timer_struct_para_init(timer_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        initpara->prescaler         = 0U;
        initpara->alignedmode       = TIMER_COUNTER_EDGE;
        initpara->counterdirection  = TIMER_COUNTER_UP;
        initpara->period            = 65535U;
        initpara->clockdivision     = TIMER_CKDIV_DIV1;
        initpara->repetitioncounter = 0U;
    }
}

/*!
    \brief      initialize TIMER counter (API_ID(0x0003U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  initpara: init parameter struct
                  prescaler: prescaler value of the counter clock, 0~65535
                  alignedmode: TIMER_COUNTER_EDGE, TIMER_COUNTER_CENTER_DOWN, TIMER_COUNTER_CENTER_UP, TIMER_COUNTER_CENTER_BOTH
                  counterdirection: TIMER_COUNTER_UP, TIMER_COUNTER_DOWN
                  period: counter auto reload value, 0~65535
                  clockdivision: TIMER_CKDIV_DIV1, TIMER_CKDIV_DIV2, TIMER_CKDIV_DIV4
                  repetitioncounter: counter repetition value, 0~255
    \param[out] none
    \retval     none
*/
void timer_init(uint32_t timer_periph, timer_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0003U), ERR_PERIPH);
    } else if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_ALIGNED(initpara->alignedmode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_CLOCKDIVISION(initpara->clockdivision)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the counter prescaler value */
        TIMER_PSC(timer_periph) = (uint16_t)initpara->prescaler;

        /* configure the counter direction and aligned mode: Apply for AT and GT */
        TIMER_CTL0(timer_periph) &= (~(uint32_t)(TIMER_CTL0_DIR | TIMER_CTL0_CAM));
        TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->alignedmode & ALIGNEDMODE_MASK);
        TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->counterdirection & COUNTERDIRECTION_MASK);

