sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
        /* configure the autoreload value */
        TIMER_CAR(timer_periph) = (uint32_t)initpara->period;

        /* configure the clock division value:Apply for Basic Timer */
        /* reset the CKDIV bit */
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CKDIV);
        TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->clockdivision & CLOCKDIVISION_MASK);

        /* apply for: advanced timer */
        if((TIMER1 != timer_periph) && (TIMER2 != timer_periph)){
            /* configure the repetition counter value */
            TIMER_CREP(timer_periph) = (uint32_t)initpara->repetitioncounter;
        }

        /* generate an update event */
        TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
    }
}

/*!
    \brief      enable a TIMER (API_ID(0x0004U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_enable(uint32_t timer_periph)
{
    #ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_CEN;
    }
}

/*!
    \brief      disable a TIMER (API_ID(0x0005U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_disable(uint32_t timer_periph)
{
    #ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0005U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_CEN;
    }
}

/*!
    \brief      enable the auto reload shadow function (API_ID(0x0006U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_enable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0006U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_ARSE;
    }
}

/*!
    \brief      disable the auto reload shadow function (API_ID(0x0007U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_disable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0007U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_ARSE;
    }
}

/*!
    \brief      enable the update event (API_ID(0x0008U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_update_event_enable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
    TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_UPDIS;
    }
}

/*!
    \brief      disable the update event (API_ID(0x0009U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_update_event_disable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0009U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
    TIMER_CTL0(timer_periph) |= (uint32_t) TIMER_CTL0_UPDIS;
    }
}

/*!
    \brief      set TIMER counter alignment mode (API_ID(0x000AU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  aligned: aligned mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_COUNTER_EDGE: edge-aligned mode
      \arg        TIMER_COUNTER_CENTER_DOWN: center-aligned and counting down assert mode
      \arg        TIMER_COUNTER_CENTER_UP: center-aligned and counting up assert mode
      \arg        TIMER_COUNTER_CENTER_BOTH: center-aligned and counting up/down assert mode
    \param[out] none
    \retval     none
*/
void timer_counter_alignment(uint32_t timer_periph, uint16_t aligned)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    } else if(NOT_TIMER_ALIGNED(aligned)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= (uint32_t)(~TIMER_CTL0_CAM);
        TIMER_CTL0(timer_periph) |= (uint32_t)aligned;
    }
}

/*!
    \brief      set TIMER counter up direction (API_ID(0x000BU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_counter_up_direction(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_DIR;
    }
}

/*!
    \brief      set TIMER counter down direction (API_ID(0x000CU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_counter_down_direction(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_DIR;
    }
}

/*!
    \brief      configure TIMER prescaler (API_ID(0x000DU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  prescaler: prescaler value, 0~65535
    \param[in]  pscreload: prescaler reload mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_PSC_RELOAD_NOW: the prescaler is loaded right now
      \arg        TIMER_PSC_RELOAD_UPDATE: the prescaler is loaded at the next update event
    \param[out] none
    \retval     none
*/
void timer_prescaler_config(uint32_t timer_periph, uint16_t prescaler, uint32_t pscreload)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    } else if(NOT_TIMER_PSCRELOAD(pscreload)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_PSC(timer_periph) = (uint32_t)prescaler;

        if(TIMER_PSC_RELOAD_NOW == pscreload) {
            TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
        }
    }
}

/*!
    \brief      configure TIMER repetition register value (API_ID(0x000EU))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  repetition: the counter repetition value, 0~255
    \param[out] none
    \retval     none
*/
void timer_repetition_value_config(uint32_t timer_periph, uint16_t repetition)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CREP(timer_periph) = (uint32_t)repetition;
    }
}

/*!
    \brief      configure TIMER autoreload register value (API_ID(0x000FU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  autoreload: the counter auto-reload value, 0~65535
    \param[out] none
    \retval     none
*/
void timer_autoreload_value_config(uint32_t timer_periph, uint16_t autoreload)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CAR(timer_periph) = (uint32_t)autoreload;
    }
}

/*!
    \brief      get TIMER autoreload register value (API_ID(0x0010U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     counter auto reload register value, 0~0xFFFF
*/
uint32_t timer_autoreload_value_read(uint32_t timer_periph)
{
    uint32_t autoreload = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        autoreload =  TIMER_CAR(timer_periph);
    }
    return autoreload;
}

/*!
    \brief      configure TIMER counter register value (API_ID(0x0011U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  counter: the counter value, 0~65535
    \param[out] none
    \retval     none
*/
void timer_counter_value_config(uint32_t timer_periph, uint16_t counter)
{
    #ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CNT(timer_periph) = (uint32_t)counter;
    }
}

/*!
    \brief      read TIMER counter value (API_ID(0x0012U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     counter value, 0~65535
*/
uint32_t timer_counter_read(uint32_t timer_periph)
{
    uint32_t count_value = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        count_value = TIMER_CNT(timer_periph);
    }
    return (count_value);
}

/*!
    \brief      read TIMER prescaler value (API_ID(0x0013U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     prescaler register value, 0~65535
*/
uint16_t timer_prescaler_read(uint32_t timer_periph)
{
    uint16_t prescaler_value = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        prescaler_value = (uint16_t)(TIMER_PSC(timer_periph));
    }
    return (prescaler_value);
}

/*!
    \brief      configure TIMER single pulse mode (API_ID(0x0014U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  spmode: single pulse mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SP_MODE_SINGLE: single pulse mode
      \arg        TIMER_SP_MODE_REPETITIVE: repetitive pulse mode
    \param[out] none
    \retval     none
*/
void timer_single_pulse_mode_config(uint32_t timer_periph, uint32_t spmode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else if(NOT_TIMER_SPMODE(spmode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0014U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_SP_MODE_SINGLE == spmode) {
            TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_SPM;
        } else if(TIMER_SP_MODE_REPETITIVE == spmode) {
            TIMER_CTL0(timer_periph) &= ~((uint32_t)TIMER_CTL0_SPM);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure TIMER update source (API_ID(0x0015U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  update: update source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATE_SRC_GLOBAL: update generate by setting of UPG bit or the counter overflow/underflow,
                                           or the slave mode controller trigger
      \arg        TIMER_UPDATE_SRC_REGULAR: update generate only by counter overflow/underflow
    \param[out] none
    \retval     none
*/
void timer_update_source_config(uint32_t timer_periph, uint32_t update)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else if(NOT_TIMER_UPDATE(update)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_UPDATE_SRC_REGULAR == update) {
            TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_UPS;
        } else if(TIMER_UPDATE_SRC_GLOBAL == update) {
            TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_UPS;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure channel commutation control shadow register (API_ID(0x0016U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_control_shadow_config(uint32_t timer_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else if(NOT_TIMER_NEWVALUE(newvalue)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_CCSE;
        } else {
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCSE);
        }
    }
}

/*!
    \brief      configure TIMER channel control shadow register update control (API_ID(0x0017U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  ccuctl: channel control shadow register update control
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATECTL_CCU: the shadow registers update by when CMTG bit is set
      \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers update by when CMTG bit is set or an rising edge of TRGI occurs
    \param[out] none
    \retval     none
*/
void timer_channel_control_shadow_update_config(uint32_t timer_periph, uint32_t ccuctl)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else if(NOT_TIMER_CCUCTL(ccuctl)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0017U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_UPDATECTL_CCU == ccuctl) {
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCUC);
        } else if(TIMER_UPDATECTL_CCUTRI == ccuctl) {
            TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_CCUC;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable the TIMER DMA (API_ID(0x0018U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  dma: specify which DMA to disbale
                only one parameter can be selected which are shown as below:
      \arg        TIMER_DMA_UPD:  update DMA request, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_CH0D: channel 0 DMA request , TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_CH1D: channel 1 DMA request, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_CH2D: channel 2 DMA request, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_CH3D: channel 3 DMA request, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_CMTD: channel commutation DMA request, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_DMA_TRGD: trigger DMA request,TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_MCH0D: multi mode channel 0 DMA request, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_DMA_MCH1D: multi mode channel 1 DMA request, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_DMA_MCH2D: multi mode channel 2 DMA request, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_DMA_MCH3D: multi mode channel 3 DMA request, TIMERx(x=0,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_dma_enable(uint32_t timer_periph, uint32_t dma)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else if(NOT_TIMER_DMA(dma)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0018U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_DMAINTEN0(timer_periph) |= (uint32_t) dma;
    }
}

/*!
    \brief      disable the TIMER DMA (API_ID(0x0019U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  dma: specify which DMA to disbale
                only one parameter can be selected which are shown as below:
      \arg        TIMER_DMA_UPD:  update DMA request, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_CH0D: channel 0 DMA request , TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_CH1D: channel 1 DMA request, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_CH2D: channel 2 DMA request, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_CH3D: channel 3 DMA request, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_CMTD: channel commutation DMA request, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_DMA_TRGD: trigger DMA request,TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_DMA_MCH0D: multi mode channel 0 DMA request, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_DMA_MCH1D: multi mode channel 1 DMA request, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_DMA_MCH2D: multi mode channel 2 DMA request, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_DMA_MCH3D: multi mode channel 3 DMA request, TIMERx(x=0,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_dma_disable(uint32_t timer_periph, uint32_t dma)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else if(NOT_TIMER_DMA(dma)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0019U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_DMAINTEN0(timer_periph) &= (~(uint32_t)(dma));
    }
}

/*!
    \brief      channel DMA request source selection (API_ID(0x001AU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  dma_request: channel DMA request source selection
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMAREQUEST_CHANNELEVENT: DMA request of channel n is sent when channel n event occurs
       \arg        TIMER_DMAREQUEST_UPDATEEVENT: DMA request of channel n is sent when update event occurs
    \param[out] none
    \retval     none
*/
void timer_channel_dma_request_source_select(uint32_t timer_periph, uint32_t dma_request)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else if(NOT_TIMER_DMA_REQUEST(dma_request)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001AU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_DMAREQUEST_UPDATEEVENT == dma_request) {
            TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_DMAS;
        } else if(TIMER_DMAREQUEST_CHANNELEVENT == dma_request) {
            TIMER_CTL1(timer_periph) &= ~(uint32_t)TIMER_CTL1_DMAS;
        } else {
            /* illegal parameters */
        }
    }
}

