sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
/*!
    \brief      configure the TIMER DMA transfer (API_ID(0x001BU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  dma_baseaddr: DMA access base address
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMACFG_DMATA_CTL0: DMA transfer address is TIMER_CTL0, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CTL1: DMA transfer address is TIMER_CTL1, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_SMCFG: DMA transfer address is TIMER_SMCFG, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_DMAINTEN: DMA transfer address is TIMER_DMAINTEN, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_INTF: DMA transfer address is TIMER_INTF, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_SWEVG: DMA transfer address is TIMER_SWEVG, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CHCTL0: DMA transfer address is TIMER_CHCTL0, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CHCTL1: DMA transfer address is TIMER_CHCTL1, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CHCTL2: DMA transfer address is TIMER_CHCTL2, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CNT: DMA transfer address is TIMER_CNT, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_PSC: DMA transfer address is TIMER_PSC, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CAR: DMA transfer address is TIMER_CAR, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CREP: DMA transfer address is TIMER_CREP, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_CH0CV: DMA transfer address is TIMER_CH0CV, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CH1CV: DMA transfer address is TIMER_CH1CV, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CH2CV: DMA transfer address is TIMER_CH2CV, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CH3CV: DMA transfer address is TIMER_CH3CV, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CCHP: DMA transfer address is TIMER_CCHP, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_MCHCTL0: DMA transfer address is TIMER_MCHCTL0, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_MCHCTL1: DMA transfer address is TIMER_MCHCTL1, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_MCHCTL2: DMA transfer address is TIMER_MCHCTL2, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_MCH0CV: DMA transfer address is TIMER_MCH0CV, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_MCH1CV: DMA transfer address is TIMER_MCH1CV, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_MCH2CV: DMA transfer address is TIMER_MCH2CV, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_MCH3CV: DMA transfer address is TIMER_MCH3CV, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_CH0CV_ADD: DMA transfer address is TIMER_CH0CV_ADD, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CH1CV_ADD: DMA transfer address is TIMER_CH1CV_ADD, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CH2CV_ADD: DMA transfer address is TIMER_CH2CV_ADD, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CH3CV_ADD: DMA transfer address is TIMER_CH3CV_ADD, TIMERx(x=0~2,7,19~20,60~63)
       \arg        TIMER_DMACFG_DMATA_CTL2: DMA transfer address is TIMER_CTL2, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_BRKCFG: DMA transfer address is TIMER_BRKCFG, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_FCCHP0: DMA transfer address is TIMER_FCCHP0, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_FCCHP1: DMA transfer address is TIMER_FCCHP1, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_FCCHP2: DMA transfer address is TIMER_FCCHP2, TIMERx(x=0,7,19,20,60,61,62,63)
       \arg        TIMER_DMACFG_DMATA_FCCHP3: DMA transfer address is TIMER_FCCHP3, TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  dma_lenth: access burst length
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMACFG_DMATC_xTRANSFER(x=1~35): DMA transfer x time
    \param[out] none
    \retval     none
*/
void timer_dma_transfer_config(uint32_t timer_periph, uint32_t dma_baseaddr, uint32_t dma_lenth)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    } else if(NOT_TIMER_DMA_BASEADDR(dma_baseaddr)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_DMA_LENGTH(dma_lenth)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_DMACFG(timer_periph) &= (~(uint32_t)(TIMER_DMACFG_DMATA | TIMER_DMACFG_DMATC));
        TIMER_DMACFG(timer_periph) |= (uint32_t)(dma_baseaddr | dma_lenth);
    }
}

/*!
    \brief      software generate events (API_ID(0x001CU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  event: the timer software event generation sources
                only one parameter can be selected which are shown as below:
      \arg        TIMER_EVENT_SRC_UPG: update event generation, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_EVENT_SRC_CH0G: channel 0 capture or compare event generation, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_EVENT_SRC_CH1G: channel 1 capture or compare event generation, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_EVENT_SRC_CH2G: channel 2 capture or compare event generation, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_EVENT_SRC_CH3G: channel 3 capture or compare event generation, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_EVENT_SRC_CMTG: channel commutation event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_TRGG: trigger event generation, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_EVENT_SRC_BRKG:  break event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_MCH0G: multi mode channel 0 capture or compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_MCH1G: multi mode channel 1 capture or compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_MCH2G: multi mode channel 2 capture or compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_MCH3G: multi mode channel 3 capture or compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_MCH0COMADDG:Multi mode Channel 0 additional compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_MCH1COMADDG:Multi mode Channel 1 additional compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_MCH2COMADDG:Multi mode Channel 2 additional compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_MCH3COMADDG:Multi mode Channel 3 additional compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_CH0COMADDG: channel 0 additional compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_CH1COMADDG: channel 1 additional compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_CH2COMADDG: channel 2 additional compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_EVENT_SRC_CH3COMADDG: channel 3 additional compare event generation, TIMERx(x=0,7,19,20,60,61,62,63)
    \param[out] none
    \retval     none
*/
void timer_event_software_generate(uint32_t timer_periph, uint32_t event)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else if(NOT_TIMER_EVENT_SRC(event)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001CU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_SWEVG(timer_periph) |= (uint32_t)event;
    }
}

/*!
    \brief      initialize TIMER break parameter struct with a default value (API_ID(0x001DU))
    \param[in]  breakpara: TIMER break parameter struct
    \param[out] none
    \retval     none
*/
void timer_break_struct_para_init(timer_break_parameter_struct *breakpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(breakpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the break parameter struct member with the default value */
        breakpara->runoffstate     = (uint16_t)TIMER_ROS_STATE_DISABLE;
        breakpara->ideloffstate    = (uint16_t)TIMER_IOS_STATE_DISABLE;
        breakpara->deadtime        = 0U;
        breakpara->breakpolarity   = (uint16_t)TIMER_BREAK_POLARITY_LOW;
        breakpara->outputautostate = (uint16_t)TIMER_OUTAUTO_DISABLE;
        breakpara->protectmode     = (uint16_t)TIMER_CCHP_PROT_OFF;
        breakpara->breakstate      = (uint16_t)TIMER_BREAK_DISABLE;
        breakpara->dtshadow        = (uint16_t)TIMER_DEADTIME_SHADOW_DISABLE;
    }
}

/*!
    \brief      configure TIMER break function (API_ID(0x001EU))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  breakpara: TIMER break parameter struct
                  runoffstate: TIMER_ROS_STATE_ENABLE, TIMER_ROS_STATE_DISABLE
                  ideloffstate: TIMER_IOS_STATE_ENABLE, TIMER_IOS_STATE_DISABLE
                  deadtime: 0~255
                  breakpolarity: TIMER_BREAK_POLARITY_LOW, TIMER_BREAK_POLARITY_HIGH
                  outputautostate: TIMER_OUTAUTO_ENABLE, TIMER_OUTAUTO_DISABLE
                  protectmode: TIMER_CCHP_PROT_OFF, TIMER_CCHP_PROT_0, TIMER_CCHP_PROT_1, TIMER_CCHP_PROT_2
                  breakstate: TIMER_BREAK_ENABLE, TIMER_BREAK_DISABLE
                  dtshadow: TIMER_DEADTIME_SHADOW_ENABLE, TIMER_DEADTIME_SHADOW_DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_config(uint32_t timer_periph, timer_break_parameter_struct *breakpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(breakpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001EU), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_BREAK_RUNOFFSTATE(breakpara->runoffstate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_BREAK_IDELOFFSTATE(breakpara->ideloffstate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_BREAK_DEADTIME(breakpara->deadtime)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001EU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_TIMER_BREAK_POLARITY(breakpara->breakpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_BREAK_OUTPUTAUTOSTATE(breakpara->outputautostate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_BREAK_PROTECTMODE(breakpara->protectmode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_BREAK_BREAKSTATE(breakpara->breakstate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_BREAK_DTSHADOW(breakpara->dtshadow)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CCHP(timer_periph) = (uint32_t)(((uint32_t)(breakpara->runoffstate)) |
                                              ((uint32_t)(breakpara->ideloffstate)) |
                                              ((uint32_t)(breakpara->deadtime)) |
                                              ((uint32_t)(breakpara->breakpolarity)) |
                                              ((uint32_t)(breakpara->outputautostate)) |
                                              ((uint32_t)(breakpara->protectmode)) |
                                              ((uint32_t)(breakpara->breakstate))|
                                              ((uint32_t)(breakpara->dtshadow)));
    }
}

/*!
    \brief      enable TIMER break function (API_ID(0x001FU))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[out] none
    \retval     none
*/
void timer_break_enable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRKEN;
    }
}

/*!
    \brief      disable TIMER break function (API_ID(0x0020U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[out] none
    \retval     none
*/
void timer_break_disable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CCHP(timer_periph) &= ~(uint32_t)TIMER_CCHP_BRKEN;
    }
}

/*!
    \brief      enable TIMER counter freeze in break mode (API_ID(0x0021U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19,20,60,61,62,63)
    \param[out] none
    \retval     none
*/
void timer_counter_freeze_enable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0021U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= TIMER_CTL0_CFBEN;
    }
}

/*!
    \brief      disable TIMER counter freeze in break mode (API_ID(0x0022U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19,20,60,61,62,63)
    \param[out] none
    \retval     none
*/
void timer_counter_freeze_disable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0022U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_CFBEN;
    }
}

/*!
    \brief      enable TIMER output automatic function (API_ID(0x0023U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[out] none
    \retval     none
*/
void timer_automatic_output_enable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0023U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_OAEN;
    }
}

/*!
    \brief      disable TIMER output automatic function (API_ID(0x0024U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[out] none
    \retval     none
*/
void timer_automatic_output_disable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CCHP(timer_periph) &= ~(uint32_t)TIMER_CCHP_OAEN;
    }
}

/*!
    \brief      configure TIMER primary output function (API_ID(0x0025U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19,20,60,61,62,63)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_primary_output_config(uint32_t timer_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0025U), ERR_PERIPH);
    } else if(NOT_TIMER_NEWVALUE(newvalue)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_POEN;
        } else {
            TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_POEN);
        }
    }
}

/*!
    \brief      initialize TIMER channel output parameter struct with a default value (API_ID(0x0026U))
    \param[in]  ocpara: TIMER channel n output parameter struct
    \param[out] none
    \retval     none
*/
void timer_channel_output_struct_para_init(timer_oc_parameter_struct *ocpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ocpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0026U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the channel output parameter struct member with the default value */
        ocpara->outputstate  = TIMER_CCX_DISABLE;
        ocpara->outputnstate = TIMER_CCXN_DISABLE;
        ocpara->ocpolarity   = TIMER_OC_POLARITY_HIGH;
        ocpara->ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
        ocpara->ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
        ocpara->ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
    }
}

/*!
    \brief      configure TIMER channel output function (API_ID(0x0027U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  ocpara: TIMER channel output parameter struct
                  outputstate: TIMER_CCX_ENABLE, TIMER_CCX_DISABLE
                  outputnstate: TIMER_CCXN_ENABLE, TIMER_CCXN_DISABLE
                  ocpolarity: TIMER_OC_POLARITY_HIGH, TIMER_OC_POLARITY_LOW
                  ocnpolarity: TIMER_OCN_POLARITY_HIGH, TIMER_OCN_POLARITY_LOW
                  ocidlestate: TIMER_OC_IDLE_STATE_LOW, TIMER_OC_IDLE_STATE_HIGH
                  ocnidlestate: TIMER_OCN_IDLE_STATE_LOW, TIMER_OCN_IDLE_STATE_HIGH
    \param[out] none
    \retval     none
*/
void timer_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_oc_parameter_struct *ocpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else if(NOT_TIMER_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0027U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(ocpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0027U), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_OUTPUTSTATE(ocpara->outputstate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_OUTPUTNSTATE(ocpara->outputnstate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_OCPOLARITY(ocpara->ocpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_OCNPOLARITY(ocpara->ocnpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_OCIDLESTATE(ocpara->ocidlestate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_OCNIDLESTATE(ocpara->ocnidlestate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)ocpara->outputstate;
            /* reset the CH0P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0P);
            /* set the CH0P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)ocpara->ocpolarity;

            if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) ||
                    (TIMER19 == timer_periph) || (TIMER20 == timer_periph) || (TIMER60 == timer_periph) 
                    || (TIMER61 == timer_periph) || (TIMER62 == timer_periph) || (TIMER63 == timer_periph)) {
                /* reset the MCH0EN bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
                /* set the MCH0EN bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)ocpara->outputnstate;

                /* reset the MCH0P bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0P);
                /* set the MCH0P bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)ocpara->ocnpolarity;

