sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
                /* reset the ISO0 bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO0);
                /* set the ISO0 bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)ocpara->ocidlestate;

                /* reset the ISO0N bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO0N);
                /* set the ISO0N bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)ocpara->ocnidlestate;
            }
            TIMER_CHCTL0(timer_periph) &= ~(uint32_t)TIMER_CHCTL0_CH0MS;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->outputstate) << 4U);
            /* reset the CH1P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1P);
            /* set the CH1P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocpolarity) << 4U);

            if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) ||
                    (TIMER19 == timer_periph) || (TIMER20 == timer_periph) || (TIMER60 == timer_periph) 
                    || (TIMER61 == timer_periph) || (TIMER62 == timer_periph) || (TIMER63 == timer_periph)) {
                /* reset the MCH1EN bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1EN);
                /* set the MCH1EN bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->outputnstate) << 4U);
                /* reset the MCH1P bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1P);
                /* set the MCH1P bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocnpolarity) << 4U);
                /* reset the ISO1 bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
                /* set the ISO1 bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocidlestate) << 2U);
                /* reset the ISO1N bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1N);
                /* set the ISO1N bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocnidlestate) << 2U);
            }
            TIMER_CHCTL0(timer_periph) &= ~(uint32_t)TIMER_CHCTL0_CH1MS;
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            /* reset the CH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2EN);
            /* set the CH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->outputstate) << 8U);
            /* reset the CH2P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2P);
            /* set the CH2P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocpolarity) << 8U);

            if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) ||
               (TIMER19 == timer_periph) || (TIMER20 == timer_periph) || (TIMER60 == timer_periph) 
               || (TIMER61 == timer_periph) || (TIMER62 == timer_periph) || (TIMER63 == timer_periph)) {
                /* reset the MCH2EN bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2EN);
                /* set the MCH2EN bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->outputnstate) << 8U);
                /* reset the MCH2P bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2P);
                /* set the MCH2P bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocnpolarity) << 8U);
                /* reset the ISO2 bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2);
                /* set the ISO2 bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocidlestate) << 4U);
                /* reset the ISO2N bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2N);
                /* set the ISO2N bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocnidlestate) << 4U);
            }
            TIMER_CHCTL1(timer_periph) &= ~(uint32_t)TIMER_CHCTL1_CH2MS;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            /* reset the CH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
            /* set the CH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->outputstate) << 12U);
            /* reset the CH3P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3P);
            /* set the CH3P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocpolarity) << 12U);

            if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) ||
                    (TIMER19 == timer_periph) || (TIMER20 == timer_periph) || (TIMER60 == timer_periph) 
                    || (TIMER61 == timer_periph) || (TIMER62 == timer_periph) || (TIMER63 == timer_periph)) {
                /* reset the MCH3EN bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3EN);
                /* set the MCH3EN bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->outputnstate) << 12U);
                /* reset the MCH3P bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3P);
                /* set the MCH3P bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocnpolarity) << 12U);
                /* reset the ISO3 bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO3);
                /* set the ISO3 bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocidlestate) << 6U);
                /* reset the ISO3N bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO3N);
                /* set the ISO3N bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocnidlestate) << 6U);
            }
            TIMER_CHCTL1(timer_periph) &= ~(uint32_t)TIMER_CHCTL1_CH3MS;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER channel output compare mode (API_ID(0x0028U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[in]  ocmode: channel output compare mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_MODE_TIMING: timing mode
      \arg        TIMER_OC_MODE_ACTIVE: active mode
      \arg        TIMER_OC_MODE_INACTIVE: inactive mode
      \arg        TIMER_OC_MODE_TOGGLE: toggle mode
      \arg        TIMER_OC_MODE_LOW: force low mode
      \arg        TIMER_OC_MODE_HIGH: force high mode
      \arg        TIMER_OC_MODE_PWM0: PWM mode 0
      \arg        TIMER_OC_MODE_PWM1: PWM mode 1
      \arg        TIMER_OC_MODE_CMP_PWM0:Composite PWM mode 0 
      \arg        TIMER_OC_MODE_CMP_PWM1:Composite PWM mode 1 
      \arg        TIMER_OC_MODE_ASYM_PWM0:Asymmetric PWM mode 0 
      \arg        TIMER_OC_MODE_ASYM_PWM1:Asymmetric PWM mode 1 
    \param[out] none
    \retval     none
*/
void timer_channel_output_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t ocmode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0028U), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0028U), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_OCMODE(ocmode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMCTL);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)ocmode;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMCTL);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)(ocmode) << 8U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMCTL);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)ocmode;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMCTL);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)(ocmode) << 8U);
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMCTL);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)ocmode;
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMCTL);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)((uint32_t)(ocmode) << 8U);
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMCTL);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)ocmode;
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMCTL);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)((uint32_t)(ocmode) << 8U);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      enable channel period point match moment output control (API_ID(0x0029U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[out] none
    \retval     none
*/
void timer_channel_period_output_control_enable(uint32_t timer_periph, uint16_t channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0029U), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0029U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* enable TIMER_CH_0 period output control */
        case TIMER_CH_0:
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0PERFOREN;
            break;
        /* enable TIMER_CH_1 period output control */
        case TIMER_CH_1:
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1PERFOREN;
            break;
        /* enable TIMER_CH_2 period output control */
        case TIMER_CH_2:
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH2PERFOREN;
            break;
        /* enable TIMER_CH_3 period output control */
        case TIMER_CH_3:
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH3PERFOREN;
            break;
        /* enable TIMER_MCH_0 period output control */
        case TIMER_MCH_0:
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH0PERFOREN;
            break;
        /* enable TIMER_MCH_1 period output control */
        case TIMER_MCH_1:
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH1PERFOREN;
            break;
        /* enable TIMER_MCH_2 period output control */
        case TIMER_MCH_2:
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH2PERFOREN;
            break;
        /* enable TIMER_MCH_3 period output control */
        case TIMER_MCH_3:
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH3PERFOREN;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      disable channel period point match moment output control (API_ID(0x002AU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[out] none
    \retval     none
*/
void timer_channel_period_output_control_disable(uint32_t timer_periph, uint16_t channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002AU), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* disable TIMER_CH_0 period output control */
        case TIMER_CH_0:
            TIMER_CHCTL2(timer_periph) &= ~(uint32_t)TIMER_CHCTL2_CH0PERFOREN;
            break;
        /* disable TIMER_CH_1 period output control */
        case TIMER_CH_1:
            TIMER_CHCTL2(timer_periph) &= ~(uint32_t)TIMER_CHCTL2_CH1PERFOREN;
            break;
        /* disable TIMER_CH_2 period output control */
        case TIMER_CH_2:
            TIMER_CHCTL2(timer_periph) &= ~(uint32_t)TIMER_CHCTL2_CH2PERFOREN;
            break;
        /* disable TIMER_CH_3 period output control */
        case TIMER_CH_3:
            TIMER_CHCTL2(timer_periph) &= ~(uint32_t)TIMER_CHCTL2_CH3PERFOREN;
            break;
        /* disable TIMER_MCH_0 period output control */
        case TIMER_MCH_0:
            TIMER_CHCTL2(timer_periph) &= ~(uint32_t)TIMER_CHCTL2_MCH0PERFOREN;
            break;
        /* disable TIMER_MCH_1 period output control */
        case TIMER_MCH_1:
            TIMER_CHCTL2(timer_periph) &= ~(uint32_t)TIMER_CHCTL2_MCH1PERFOREN;
            break;
        /* disable TIMER_MCH_2 period output control */
        case TIMER_MCH_2:
            TIMER_CHCTL2(timer_periph) &= ~(uint32_t)TIMER_CHCTL2_MCH2PERFOREN;
            break;
        /* disable TIMER_MCH_3 period output control */
        case TIMER_MCH_3:
            TIMER_CHCTL2(timer_periph) &= ~(uint32_t)TIMER_CHCTL2_MCH3PERFOREN;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER channel output pulse value (API_ID(0x002BU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[in]  pulse: channel output pulse value
    \param[out] none
    \retval     none
*/
void timer_channel_output_pulse_value_config(uint32_t timer_periph, uint16_t channel, uint32_t pulse)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002BU), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CH0CV(timer_periph) = (uint32_t)pulse;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CH1CV(timer_periph) = (uint32_t)pulse;
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CH2CV(timer_periph) = (uint32_t)pulse;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CH3CV(timer_periph) = (uint32_t)pulse;
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCH0CV(timer_periph) = (uint32_t)pulse;
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCH1CV(timer_periph) = (uint32_t)pulse;
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCH2CV(timer_periph) = (uint32_t)pulse;
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCH3CV(timer_periph) = (uint32_t)pulse;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER channel output shadow function (API_ID(0x002CU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[in]  ocshadow: channel output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_SHADOW_ENABLE: channel output compare shadow enable
      \arg        TIMER_OC_SHADOW_DISABLE: channel output compare shadow disable
      \arg        TIMER_OMC_SHADOW_ENABLE: multi mode channel output compare shadow enable
      \arg        TIMER_OMC_SHADOW_DISABLE: multi mode channel output compare shadow disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002CU), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002CU), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_OCSHADOW(ocshadow)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002CU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMSEN);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)ocshadow;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMSEN);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)(ocshadow) << 8U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMSEN);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)ocshadow;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMSEN);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)(ocshadow) << 8U);
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMSEN);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)ocshadow;
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMSEN);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)((uint32_t)(ocshadow) << 8U);
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMSEN);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)ocshadow;
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMSEN);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)((uint32_t)(ocshadow) << 8U);
            break;
        default:
            break;
        }
    }
}

