sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
/*!
    \brief      configure TIMER channel output clear function (API_ID(0x002DU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[in]  occlear: channel output clear function
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_CLEAR_ENABLE: channel output clear function enable
      \arg        TIMER_OC_CLEAR_DISABLE: channel output clear function disable
      \arg        TIMER_OMC_CLEAR_ENABLE: multi mode channel output clear function enable
      \arg        TIMER_OMC_CLEAR_DISABLE: multi mode channel output clear function disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_clear_config(uint32_t timer_periph, uint16_t channel, uint16_t occlear)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002DU), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002DU), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_OCCLEAR(occlear)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002DU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMCEN);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)occlear;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMCEN);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)occlear << 8U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMCEN);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)occlear;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMCEN);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)occlear << 8U);
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMCEN);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)occlear;
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMCEN);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)((uint32_t)occlear << 8U);
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMCEN);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)occlear;
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMCEN);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)((uint32_t)occlear << 8U);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER channel output compare fast function (API_ID(0x002EU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[in]  ocfast: channel output compare fast function
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_FAST_ENABLE: channel output compare fast function enable
      \arg        TIMER_OC_FAST_DISABLE: channel output compare fast function disable
      \arg        TIMER_OMC_FAST_ENABLE: multi mode channel output compare fast function enable
      \arg        TIMER_OMC_FAST_DISABLE: multi mode channel output compare fast function disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_compare_fast_config(uint32_t timer_periph, uint16_t channel, uint16_t ocfast)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002EU), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_OCFAST(ocfast)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002EU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMFEN);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)ocfast;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMFEN);
            TIMER_CHCTL0(timer_periph) |= ((uint32_t)ocfast << 8U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMFEN);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)ocfast;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMFEN);
            TIMER_CHCTL1(timer_periph) |= ((uint32_t)ocfast << 8U);
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMFEN);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)ocfast;
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMFEN);
            TIMER_MCHCTL0(timer_periph) |= ((uint32_t)ocfast << 8U);
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMFEN);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)ocfast;
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMFEN);
            TIMER_MCHCTL1(timer_periph) |= ((uint32_t)ocfast << 8U);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER channel output polarity (API_ID(0x002FU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[in]  ocpolarity: channel output polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_POLARITY_HIGH: channel output polarity is high
      \arg        TIMER_OC_POLARITY_LOW: channel output polarity is low
      \arg        TIMER_OMC_POLARITY_HIGH: multi mode channel output polarity is high
      \arg        TIMER_OMC_POLARITY_LOW: multi mode channel output polarity is low
    \param[out] none
    \retval     none
*/
void timer_channel_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocpolarity)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002FU), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_CHANNEL_OCPOLARITY(ocpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x002FU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0P);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)ocpolarity;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1P);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocpolarity << 4U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2P);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocpolarity << 8U);
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3P);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocpolarity << 12U);
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH0FP);
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)ocpolarity;
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH1FP);
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocpolarity << 2U);
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH2FP);
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocpolarity << 4U);
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH3FP);
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocpolarity << 6U);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER channel complementary output polarity (API_ID(0x0030U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7,19,20,60,61,62,63))
    \param[in]  ocnpolarity: channel complementary output polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OCN_POLARITY_HIGH: channel complementary output polarity is high
      \arg        TIMER_OCN_POLARITY_LOW: channel complementary output polarity is low
    \param[out] none
    \retval     none
*/
void timer_channel_complementary_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnpolarity)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0030U), ERR_PERIPH);
    } else if(NOT_TIMER_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0030U), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_OCNPOLARITY(ocnpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0030U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0P);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)ocnpolarity;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1P);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocnpolarity << 4U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2P);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocnpolarity << 8U);
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3P);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocnpolarity << 12U);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER channel enable state (API_ID(0x0031U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19,20,60,61,62,63))
    \param[in]  state: TIMER channel enable state
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CCX_ENABLE: channel enable
      \arg        TIMER_CCX_DISABLE: channel disable
      \arg        TIMER_MCCX_ENABLE: multi mode channel enable
      \arg        TIMER_MCCX_DISABLE: multi mode channel disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_state_config(uint32_t timer_periph, uint16_t channel, uint32_t state)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0031U), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_CHANNEL_STATE(state)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0031U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)state;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)state << 4U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)state << 8U);
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)state << 12U);
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)state);
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(state << 4U));
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(state << 8U));
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(state << 12U));
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER channel complementary output enable state (API_ID(0x0032U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7,19,20,60,61,62,63))
    \param[in]  ocnstate: TIMER channel complementary output enable state
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CCXN_ENABLE: channel complementary enable
      \arg        TIMER_CCXN_DISABLE: channel complementary disable
    \param[out] none
    \retval     none
*/
void timer_channel_complementary_output_state_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnstate)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else if(NOT_TIMER_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0032U), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_OUTPUTNSTATE(ocnstate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0032U), ERR_PARAM_POINTER);
    } else
#endif
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)ocnstate;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocnstate << 4U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocnstate << 8U);
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3EN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)ocnstate << 12U);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      initialize TIMER channel input parameter struct with a default value (API_ID(0x0033U))
    \param[in]  icpara: TIMER channel input parameter struct
    \param[out] none
    \retval     none
*/
void timer_channel_input_struct_para_init(timer_ic_parameter_struct *icpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(icpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0033U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the channel input parameter struct member with the default value */
        icpara->icpolarity  = TIMER_IC_POLARITY_RISING;
        icpara->icselection = TIMER_IC_SELECTION_DIRECTTI;
        icpara->icprescaler = TIMER_IC_PSC_DIV1;
        icpara->icfilter    = 0U;
    }
}

/*!
    \brief      configure TIMER input capture parameter (API_ID(0x0034U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[in]  icpara: TIMER channel input parameter struct
                  icpolarity: TIMER_IC_POLARITY_RISING, TIMER_IC_POLARITY_FALLING, TIMER_IC_POLARITY_BOTH_EDGE
                  icselection: TIMER_IC_SELECTION_DIRECTTI, TIMER_IC_SELECTION_INDIRECTTI, TIMER_IC_SELECTION_ITS, TIMER_IC_SELECTION_PAIR
                  icprescaler: TIMER_IC_PSC_DIV1, TIMER_IC_PSC_DIV2, TIMER_IC_PSC_DIV4, TIMER_IC_PSC_DIV8
                  icfilter: 0~15
    \param[out]  none
    \retval      none
*/

