sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
/*!
    \brief      configure TIMER channel mult edge input capture function (API_ID(0x0038U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20, 60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[in]  buffer_level: multi edge buffer level
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_MULTI_BUFF_LEVEL_1: capture interrupt is ouccer after one capture
      \arg        TIMER_IC_MULTI_BUFF_LEVEL_2: capture interrupt is ouccer after two capture
      \arg        TIMER_IC_MULTI_BUFF_LEVEL_3: capture interrupt is ouccer after three capture
      \arg        TIMER_IC_MULTI_BUFF_LEVEL_4: capture interrupt is ouccer after four capture
    \param[in]  icpolarity: multi edge capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_MULTI_POLARITY_RISING: effective edge of the first capture is the rising edge
      \arg        TIMER_IC_MULTI_POLARITY_FALLING: effective edge captured for the first time is the falling edge
      \arg        TIMER_IC_MULTI_POLARITY_BOTH_EDGE: effective edge captured for the first time is the edge of any polarity
    \param[out] none
    \retval     none
*/
void timer_input_capture_multi_edge_config(uint32_t timer_periph, uint32_t channel, uint32_t buffer_level, uint32_t icpolarity)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0038U), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0038U), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_IC_MULTI_BUFF_LEVEL(buffer_level)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0038U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_IC_MULTI_POLARITY(icpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0038U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHMECAPCFG(timer_periph) &= (~(uint32_t)(TIMER_CHMECAPCFG_CH0MEBL | TIMER_CHMECAPCFG_CH0MECP));
            TIMER_CHMECAPCFG(timer_periph) |= (uint32_t)(buffer_level | (icpolarity << 20U));
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHMECAPCFG(timer_periph) &= (~(uint32_t)(TIMER_CHMECAPCFG_CH1MEBL | TIMER_CHMECAPCFG_CH1MECP));
            TIMER_CHMECAPCFG(timer_periph) |= (uint32_t)((buffer_level << 2U) | (icpolarity << 22U));
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHMECAPCFG(timer_periph) &= (~(uint32_t)(TIMER_CHMECAPCFG_CH2MEBL | TIMER_CHMECAPCFG_CH2MECP));
            TIMER_CHMECAPCFG(timer_periph) |= (uint32_t)((buffer_level << 4U) | (icpolarity << 24U));
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHMECAPCFG(timer_periph) &= (~(uint32_t)(TIMER_CHMECAPCFG_CH3MEBL | TIMER_CHMECAPCFG_CH3MECP));
            TIMER_CHMECAPCFG(timer_periph) |= (uint32_t)((buffer_level << 6U) | (icpolarity << 26U));
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCHMECAPCFG(timer_periph) &= (~(uint32_t)(TIMER_MCHMECAPCFG_MCH0MEBL | TIMER_MCHMECAPCFG_MCH0MECP));
            TIMER_MCHMECAPCFG(timer_periph) |= (uint32_t)(buffer_level | (icpolarity << 20U));
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCHMECAPCFG(timer_periph) &= (~(uint32_t)(TIMER_MCHMECAPCFG_MCH1MEBL | TIMER_MCHMECAPCFG_MCH1MECP));
            TIMER_MCHMECAPCFG(timer_periph) |= (uint32_t)((buffer_level << 2U) | (icpolarity << 22U));
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCHMECAPCFG(timer_periph) &= (~(uint32_t)(TIMER_MCHMECAPCFG_MCH2MEBL | TIMER_MCHMECAPCFG_MCH2MECP));
            TIMER_MCHMECAPCFG(timer_periph) |= (uint32_t)((buffer_level << 4U) | (icpolarity << 24U));
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCHMECAPCFG(timer_periph) &= (~(uint32_t)(TIMER_MCHMECAPCFG_MCH3MEBL | TIMER_MCHMECAPCFG_MCH3MECP));
            TIMER_MCHMECAPCFG(timer_periph) |= (uint32_t)((buffer_level << 6U) | (icpolarity << 26U));
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER channel mult edge input capture state (API_ID(0x0039U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20, 60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_input_capture_multi_edge_state_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0039U), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0039U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_NEWVALUE(newvalue)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0039U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue){
            switch(channel) {
            case TIMER_CH_0:
                TIMER_CHMECAPCFG(timer_periph) |= TIMER_CHMECAPCFG_CH0MECEN;
                break;
            case TIMER_CH_1:
                TIMER_CHMECAPCFG(timer_periph) |= TIMER_CHMECAPCFG_CH1MECEN;
                break;
            case TIMER_CH_2:
                TIMER_CHMECAPCFG(timer_periph) |= TIMER_CHMECAPCFG_CH2MECEN;
                break;
            case TIMER_CH_3:
                TIMER_CHMECAPCFG(timer_periph) |= TIMER_CHMECAPCFG_CH3MECEN;
                break;
            case TIMER_MCH_0:
                TIMER_MCHMECAPCFG(timer_periph) |= TIMER_MCHMECAPCFG_MCH0MECEN;
                break;
            case TIMER_MCH_1:
                TIMER_MCHMECAPCFG(timer_periph) |= TIMER_MCHMECAPCFG_MCH1MECEN;
                break;
            case TIMER_MCH_2:
                TIMER_MCHMECAPCFG(timer_periph) |= TIMER_MCHMECAPCFG_MCH2MECEN;
                break;
            case TIMER_MCH_3:
                TIMER_MCHMECAPCFG(timer_periph) |= TIMER_MCHMECAPCFG_MCH3MECEN;
                break;
            default:
                break;
            }
        }else{
            switch(channel) {
            case TIMER_CH_0:
                TIMER_CHMECAPCFG(timer_periph) &= ~TIMER_CHMECAPCFG_CH0MECEN;
                break;
            case TIMER_CH_1:
                TIMER_CHMECAPCFG(timer_periph) &= ~TIMER_CHMECAPCFG_CH1MECEN;
                break;
            case TIMER_CH_2:
                TIMER_CHMECAPCFG(timer_periph) &= ~TIMER_CHMECAPCFG_CH2MECEN;
                break;
            case TIMER_CH_3:
                TIMER_CHMECAPCFG(timer_periph) &= ~TIMER_CHMECAPCFG_CH3MECEN;
                break;
            case TIMER_MCH_0:
                TIMER_MCHMECAPCFG(timer_periph) &= ~TIMER_MCHMECAPCFG_MCH0MECEN;
                break;
            case TIMER_MCH_1:
                TIMER_MCHMECAPCFG(timer_periph) &= ~TIMER_MCHMECAPCFG_MCH1MECEN;
                break;
            case TIMER_MCH_2:
                TIMER_MCHMECAPCFG(timer_periph) &= ~TIMER_MCHMECAPCFG_MCH2MECEN;
                break;
            case TIMER_MCH_3:
                TIMER_MCHMECAPCFG(timer_periph) &= ~TIMER_MCHMECAPCFG_MCH3MECEN;
                break;
            default:
                break;
            }
        }
    }
}

/*!
    \brief      read TIMER channel multi edge capture compare register value (API_ID(0x003AU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20, 60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~2,7,19~20, 60~63))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19~20,60~63))
    \param[in]  buffer_level: multi edge buffer level
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_MULTI_BUFF_LEVEL_1: capture interrupt is ouccer after one capture
      \arg        TIMER_IC_MULTI_BUFF_LEVEL_2: capture interrupt is ouccer after two capture
      \arg        TIMER_IC_MULTI_BUFF_LEVEL_3: capture interrupt is ouccer after three capture
      \arg        TIMER_IC_MULTI_BUFF_LEVEL_4: capture interrupt is ouccer after four capture
    \param[out] channel capture compare register value(0~65535)
    \retval     
*/
uint32_t timer_channel_capture_multi_edge_value_read(uint32_t timer_periph, uint32_t channel, uint8_t buffer_level)
{
    uint32_t count_value = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003AU), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003AU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_IC_MULTI_BUFF_LEVEL(buffer_level)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003AU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {

        switch(channel) {
        case TIMER_CH_0:
            /* read TIMER_CH_0 capture compare register value */
            if(TIMER_IC_MULTI_BUFF_LEVEL_1 == buffer_level){
                count_value = TIMER_CH0CV(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_2 == buffer_level){
                count_value = TIMER_CH0CV_ADD(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_3 == buffer_level){
                count_value = TIMER_CH0MECAP(timer_periph) & TIMER_CH0MECAP_CH0CAP3;
            }else{
                count_value = (TIMER_CH0MECAP(timer_periph) & TIMER_CH0MECAP_CH0CAP4) >> 16U;
            }
            break;
        case TIMER_CH_1:
            /* read TIMER_CH_1 capture compare register value */
            if(TIMER_IC_MULTI_BUFF_LEVEL_1 == buffer_level){
                count_value = TIMER_CH1CV(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_2 == buffer_level){
                count_value = TIMER_CH1CV_ADD(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_3 == buffer_level){
                count_value = TIMER_CH1MECAP(timer_periph) & TIMER_CH1MECAP_CH1CAP3;
            }else{
                count_value = (TIMER_CH1MECAP(timer_periph) & TIMER_CH1MECAP_CH1CAP4) >> 16U;
            }
            break;
        case TIMER_CH_2:
            /* read TIMER_CH_2 capture compare register value */
            if(TIMER_IC_MULTI_BUFF_LEVEL_1 == buffer_level){
                count_value = TIMER_CH2CV(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_2 == buffer_level){
                count_value = TIMER_CH2CV_ADD(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_3 == buffer_level){
                count_value = TIMER_CH2MECAP(timer_periph) & TIMER_CH2MECAP_CH2CAP3;
            }else{
                count_value = (TIMER_CH2MECAP(timer_periph) & TIMER_CH2MECAP_CH2CAP4) >> 16U;
            }
            break;
        case TIMER_CH_3:
            /* read TIMER_CH_3 capture compare register value */
            if(TIMER_IC_MULTI_BUFF_LEVEL_1 == buffer_level){
                count_value = TIMER_CH3CV(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_2 == buffer_level){
                count_value = TIMER_CH3CV_ADD(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_3 == buffer_level){
                count_value = TIMER_CH3MECAP(timer_periph) & TIMER_CH3MECAP_CH3CAP3;
            }else{
                count_value = (TIMER_CH3MECAP(timer_periph) & TIMER_CH3MECAP_CH3CAP4) >> 16U;
            }
            break;
        case TIMER_MCH_0:
            /* read TIMER_MCH_0 capture compare register value */
            if(TIMER_IC_MULTI_BUFF_LEVEL_1 == buffer_level){
                count_value = TIMER_MCH0CV(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_2 == buffer_level){
                count_value = TIMER_MCH0CV_ADD(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_3 == buffer_level){
                count_value = TIMER_MCH0MECAP(timer_periph) & TIMER_MCH0MECAP_MCH0CAP3;
            }else{
                count_value = (TIMER_MCH0MECAP(timer_periph) & TIMER_MCH0MECAP_MCH0CAP4) >> 16U;
            }
            break;
        case TIMER_MCH_1:
            /* read TIMER_MCH_1 capture compare register value */
            if(TIMER_IC_MULTI_BUFF_LEVEL_1 == buffer_level){
                count_value = TIMER_MCH1CV(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_2 == buffer_level){
                count_value = TIMER_MCH1CV_ADD(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_3 == buffer_level){
                count_value = TIMER_MCH1MECAP(timer_periph) & TIMER_MCH1MECAP_MCH1CAP3;
            }else{
                count_value = (TIMER_MCH1MECAP(timer_periph) & TIMER_MCH1MECAP_MCH1CAP4) >> 16U;
            }
            break;
        case TIMER_MCH_2:
            /* read TIMER_MCH_2 capture compare register value */
            if(TIMER_IC_MULTI_BUFF_LEVEL_1 == buffer_level){
                count_value = TIMER_MCH2CV(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_2 == buffer_level){
                count_value = TIMER_MCH2CV_ADD(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_3 == buffer_level){
                count_value = TIMER_MCH2MECAP(timer_periph) & TIMER_MCH2MECAP_MCH2CAP3;
            }else{
                count_value = (TIMER_MCH2MECAP(timer_periph) & TIMER_MCH2MECAP_MCH2CAP4) >> 16U;
            }
            break;
        case TIMER_MCH_3:
            /* read TIMER_MCH_3 capture compare register value */
            if(TIMER_IC_MULTI_BUFF_LEVEL_1 == buffer_level){
                count_value = TIMER_MCH3CV(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_2 == buffer_level){
                count_value = TIMER_MCH3CV_ADD(timer_periph);
            }else if(TIMER_IC_MULTI_BUFF_LEVEL_3 == buffer_level){
                count_value = TIMER_MCH3MECAP(timer_periph) & TIMER_MCH3MECAP_MCH3CAP3;
            }else{
                count_value = (TIMER_MCH3MECAP(timer_periph) & TIMER_MCH3MECAP_MCH3CAP4) >> 16U;
            }
            break;
        default:
            break;
        }
    }
    return (count_value); 
}

/*!
    \brief      configure TIMER hall sensor mode (API_ID(0x003BU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  hallmode:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_HALLINTERFACE_ENABLE: TIMER hall sensor mode enable
      \arg        TIMER_HALLINTERFACE_DISABLE: TIMER hall sensor mode disable
    \param[out] none
    \retval     none
*/
void timer_hall_mode_config(uint32_t timer_periph, uint32_t hallmode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003BU), ERR_PERIPH);
    } else if(NOT_TIMER_HALL_MODE(hallmode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_HALLINTERFACE_ENABLE == hallmode) {
            TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_TI0S;
        } else if(TIMER_HALLINTERFACE_DISABLE == hallmode) {
            TIMER_CTL1(timer_periph) &= ~(uint32_t)TIMER_CTL1_TI0S;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      initialize TIMER multi mode channel output parameter struct (API_ID(0x003CU))
    \param[in]  omcpara: TIMER multi mode channel output parameter struct
    \param[out] none
    \retval     none
*/
void timer_multi_mode_channel_output_parameter_struct_init(timer_omc_parameter_struct *omcpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(omcpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the multi mode channel output parameter struct with the default value */
        omcpara->outputmode  = TIMER_MCH_MODE_COMPLEMENTARY;
        omcpara->outputstate = TIMER_MCCX_DISABLE;
        omcpara->ocpolarity  = TIMER_OMC_POLARITY_LOW;
    }
}

/*!
    \brief      configure TIMER multi mode channel output function (API_ID(0x003DU))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19,20,60,61,62,63))
    \param[in]  omcpara: TIMER multi mode channel output parameter struct
                  outputmode: TIMER_MCH_MODE_INDEPENDENTLY, TIMER_MCH_MODE_MIRRORED, TIMER_MCH_MODE_COMPLEMENTARY
                  outputstate: TIMER_MCCX_ENABLE, TIMER_MCCX_DISABLE
                  ocpolarity: TIMER_OMC_POLARITY_HIGH, TIMER_OMC_POLARITY_LOW
    \param[out] none
    \retval     none
*/
void timer_multi_mode_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_omc_parameter_struct *omcpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003DU), ERR_PERIPH);
    } else if(NOT_TIMER_MULTI_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else if(NOT_VALID_POINTER(omcpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003DU), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_MULTI_MODE_CHANNEL_OUTPUT_MODE(omcpara->outputmode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_MULTI_MODE_CHANNEL_OUTPUT_STATE(omcpara->outputstate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_MULTI_MODE_CHANNEL_OCPOLARITY(omcpara->ocpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_CTL2(timer_periph) &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << 20U));
            TIMER_CTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->outputmode) << 20U);
            /* reset the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
            /* set the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->outputstate));

            /* reset the MCH0FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH0FP);
            /* set the MCH0FP bit */
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)omcpara->ocpolarity;

            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0MS);
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_CTL2(timer_periph) &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << 22U));
            TIMER_CTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->outputmode) << 22U);
            /* reset the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1EN);
            /* set the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->outputstate) << 4U);

            /* reset the MCH1FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH1FP);
            /* set the MCH1FP bit */
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->ocpolarity) << 2U);

            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1MS);
            break;

        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_CTL2(timer_periph) &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << 24U));
            TIMER_CTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->outputmode) << 24U);
            /* reset the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2EN);
            /* set the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->outputstate) << 8U);

            /* reset the MCH2FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH2FP);
            /* set the MCH2FP bit */
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->ocpolarity) << 4U);

            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2MS);
            break;

