sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_CTL2(timer_periph) &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << 26U));
            TIMER_CTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->outputmode)  << 26U);
            /* reset the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3EN);
            /* set the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->outputstate) << 12U);

            /* reset the MCH3FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH3FP);
            /* set the MCH3FP bit */
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)((uint32_t)(omcpara->ocpolarity) << 6U);

            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3MS);

            break;
        default:
            break;
        }
    }
}

/*!
    \brief      multi mode channel mode select (API_ID(0x003EU))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19,20,60,61,62,63))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19,20,60,61,62,63))
    \param[in]  multi_mode_sel: multi mode channel mode selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_MODE_INDEPENDENTLY: multi mode channel work in independently mode
      \arg        TIMER_MCH_MODE_MIRRORED:      multi mode channel work in mirrored output mode
      \arg        TIMER_MCH_MODE_COMPLEMENTARY: multi mode channel work in complementary output mode
    \param[out] none
    \retval     none
*/
void timer_multi_mode_channel_mode_config(uint32_t timer_periph, uint32_t channel, uint32_t multi_mode_sel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003EU), ERR_PERIPH);
    } else if(NOT_TIMER_MULTI_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_MULTI_CHANNEL_MODE_SELECTION(multi_mode_sel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003EU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg = TIMER_CTL2(timer_periph);
        switch(channel) {
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            reg &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << 20U));
            reg |= (uint32_t)(multi_mode_sel << 20U);
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            reg &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << 22U));
            reg |= (uint32_t)(multi_mode_sel << 22U);
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            reg &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << 24U));
            reg |= (uint32_t)(multi_mode_sel << 24U);
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            reg &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << 26U));
            reg |= (uint32_t)(multi_mode_sel << 26U);
            break;
        default:
            break;
        }
        TIMER_CTL2(timer_periph) = reg;
    }
}


/*!
    \brief      select TIMER input trigger source (API_ID(0x003FU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  intrigger: input trigger source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0
      \arg        TIMER_SMCFG_TRGSEL_ITI1: internal trigger 1
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2
      \arg        TIMER_SMCFG_TRGSEL_ITI3: internal trigger 3
      \arg        TIMER_SMCFG_TRGSEL_ITI4: internal trigger 4
      \arg        TIMER_SMCFG_TRGSEL_ITI5: internal trigger 5
      \arg        TIMER_SMCFG_TRGSEL_ITI6: internal trigger 6
      \arg        TIMER_SMCFG_TRGSEL_ITI7: internal trigger 7
      \arg        TIMER_SMCFG_TRGSEL_ITI8: internal trigger 8
      \arg        TIMER_SMCFG_TRGSEL_ITI9: internal trigger 9
      \arg        TIMER_SMCFG_TRGSEL_CI0F_ED: TI0 edge detector
      \arg        TIMER_SMCFG_TRGSEL_CI0FE0: filtered channel 0 input
      \arg        TIMER_SMCFG_TRGSEL_CI1FE1: filtered channel 1 input
      \arg        TIMER_SMCFG_TRGSEL_ETIFP: filtered external trigger input
      \arg        TIMER_SMCFG_TRGSEL_CI2FE2: filtered channel 2 input
      \arg        TIMER_SMCFG_TRGSEL_CI3FE3: filtered channel 3 input
      \arg        TIMER_SMCFG_TRGSEL_MCI0FEM0: filtered multi mode channel 0 input(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_SMCFG_TRGSEL_MCI1FEM1: filtered multi mode channel 1 input(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_SMCFG_TRGSEL_MCI2FEM2: filtered multi mode channel 2 input(TIMERx(x=0,7,19~20,60~63))
      \arg        TIMER_SMCFG_TRGSEL_MCI3FEM3: filtered multi mode channel 3 input(TIMERx(x=0,7,19~20,60~63))
    \param[out] none
    \retval     none
*/
void timer_input_trigger_source_select(uint32_t timer_periph, uint32_t intrigger)
{
        uint32_t timerx_temp = 0U;
        uint32_t reg_temp1, reg_temp2, reg_temp3;
        uint32_t timer_base_addr;
        uint32_t reg_temp;
        uint32_t i;
        uint32_t j;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003FU), ERR_PERIPH);
    } else if(NOT_TIMER_INPUT_TRIGGER_SOURCE(intrigger)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(timer_periph){
        case TIMER0:
            timerx_temp = SYSCFG_TIMER0;
            break;
        case TIMER1:
            timerx_temp = SYSCFG_TIMER1;
            break;
        case TIMER2:
            timerx_temp = SYSCFG_TIMER2;
            break;
        case TIMER7:
            timerx_temp = SYSCFG_TIMER7;
            break;
        case TIMER19:
            timerx_temp = SYSCFG_TIMER19;
            break;
        case TIMER20:
            timerx_temp = SYSCFG_TIMER20;
            break;
        case TIMER60:
            timerx_temp = SYSCFG_TIMER60;
            break;
        case TIMER61:
            timerx_temp = SYSCFG_TIMER61;
            break;
        case TIMER62:
            timerx_temp = SYSCFG_TIMER62;
            break;
        case TIMER63:
            timerx_temp = SYSCFG_TIMER63;
            break;
        default:
              break;
        }
        
