sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
        timer_base_addr = SYSCFG_TIMERCFG(timerx_temp);
      
        reg_temp1 = (REG32(timer_base_addr) & 0x7FFF7FFFU);
        reg_temp2 = (REG32(timer_base_addr + 4U) & 0x7FFF7FFFU);
        reg_temp3 = (REG32(timer_base_addr + 8U) & 0x7FFF7FFFU);
        
        if(((reg_temp1 & 0x7FFF7FFFU) == 0x00000000U) &&
           ((reg_temp2 & 0x7FFF7FFFU) == 0x00000000U) &&
           ((reg_temp3 & 0x7FFF7FFFU) == 0x00000000U)){
            REG32(timer_base_addr + 8U) = (uint32_t)(intrigger) << 16U;
        }else{
            for(i = 0U; i < 0x0CU; i += 4U){
                if((REG32(timer_base_addr + i) & 0x7FFF7FFFU) != 0x00000000U){
                    j = 0U;
                    reg_temp = REG32(timer_base_addr + i) & 0x7FFFU;
                    if(reg_temp == 0U){
                        j = 16U;
                        reg_temp = (REG32(timer_base_addr + i) & 0x7FFF0000U);
                    }
                    for( ; j < 31U; j += 5U){
                        if((reg_temp & ((uint32_t)0x1FU << j)) != 0U){
                            REG32(timer_base_addr + i) = (uint32_t)(intrigger) << j;
                            break;
                        }
                    }
                    
                    break;
                }
            }
        }
    }
}

/*!
    \brief      select TIMER master mode output trigger source (API_ID(0x0040U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  outtrigger: trigger output source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_TRI_OUT_SRC_RESET: the UPG bit as trigger output(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_TRI_OUT_SRC_ENABLE: the counter enable signal as trigger output(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_TRI_OUT_SRC_UPDATE: update event as trigger output(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_TRI_OUT_SRC_CH0: a capture or a compare match occurred in channel 0 as trigger output TRGO(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_TRI_OUT_SRC_O0CPRE: O0CPRE as trigger output(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_TRI_OUT_SRC_O1CPRE: O1CPRE as trigger output(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_TRI_OUT_SRC_O2CPRE: O2CPRE as trigger output(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_TRI_OUT_SRC_O3CPRE: O3CPRE as trigger output(TIMERx(x=0~2,7,19~20,60~63))
      \arg        TIMER_TRI_OUT_SRC_OVERFLOW: overflow event as trigger output
      \arg        TIMER_TRI_OUT_SRC_UNDERFLOW: underflow  event as trigger output
      \arg        TIMER_TRI_OUT_SRC_SWEVENT: software event as trigger outpu
    \param[out] none
    \retval     none
*/
void timer_master_output_trigger_source_select(uint32_t timer_periph, uint32_t outtrigger)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else if(NOT_TIMER_OUTPUT_TRIGGER_SOURCE(outtrigger)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0040U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;

        reg  = TIMER_CTL1(timer_periph);
        reg &= (~(uint32_t)TIMER_CTL1_MMC);
        reg |= (uint32_t)outtrigger;
        TIMER_CTL1(timer_periph) = reg;
    }
}

/*!
    \brief      select TIMER slave mode (API_ID(0x0041U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  slavemode: slave mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SLAVE_MODE_DISABLE: slave mode disable
      \arg        TIMER_QUAD_DECODER_MODE0: quadrature decoder mode 0
      \arg        TIMER_QUAD_DECODER_MODE1: quadrature decoder mode 1
      \arg        TIMER_QUAD_DECODER_MODE2: quadrature decoder mode 2
      \arg        TIMER_SLAVE_MODE_RESTART: restart mode
      \arg        TIMER_SLAVE_MODE_PAUSE: pause mode
      \arg        TIMER_SLAVE_MODE_EVENT: event mode
      \arg        TIMER_SLAVE_MODE_EXTERNAL0: external clock mode 0
      \arg        TIMER_SLAVE_MODE_RESTART_EVENT: restart + event mode
      \arg        TIMER_DECODER_MODE0: decoder mode 0
      \arg        TIMER_DECODER_MODE1: decoder mode 1
      \arg        TIMER_DECODER_MODE2: decoder mode 2
      \arg        TIMER_DECODER_MODE3: decoder mode 3
    \param[out] none
    \retval     none
*/
void timer_slave_mode_select(uint32_t timer_periph, uint32_t slavemode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0041U), ERR_PERIPH);
    } else if(NOT_TIMER_SLAVE_MODE_SELECT(slavemode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0041U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t timerx_temp = 0U;
        uint32_t timerxcfg_addr;
        uint32_t timer_base_addr;
        uint32_t trigger_temp = 0U;
        uint32_t trigger_off;
        uint32_t reg_temp;
        uint32_t i;
        uint32_t j;
        uint32_t reg_temp1, reg_temp2, reg_temp3;

        switch(timer_periph){
        case TIMER0:
            timerx_temp = SYSCFG_TIMER0;
            break;
        case TIMER1:
            timerx_temp = SYSCFG_TIMER1;
            break;
        case TIMER2:
            timerx_temp = SYSCFG_TIMER2;
            break;
        case TIMER7:
            timerx_temp = SYSCFG_TIMER7;
            break;
        case TIMER19:
            timerx_temp = SYSCFG_TIMER19;
            break;
        case TIMER20:
            timerx_temp = SYSCFG_TIMER20;
            break;
        case TIMER60:
            timerx_temp = SYSCFG_TIMER60;
            break;
        case TIMER61:
            timerx_temp = SYSCFG_TIMER61;
            break;
        case TIMER62:
            timerx_temp = SYSCFG_TIMER62;
            break;
        case TIMER63:
            timerx_temp = SYSCFG_TIMER63;
            break;
        default:
              break;
        }
        
