sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
        timer_base_addr = SYSCFG_TIMERCFG(timerx_temp);
        timerxcfg_addr = (timer_base_addr + (slavemode / 6U) * 4U);
        trigger_off = (((slavemode / 3U) * 16U) + ((slavemode % 3U) * 5U)) % 32U;
        
        reg_temp1 = (REG32(timer_base_addr) & 0x7FFF7FFFU);
        reg_temp2 = (REG32(timer_base_addr + 4U) & 0x7FFF7FFFU);
        reg_temp3 = (REG32(timer_base_addr + 8U) & 0x7FFF7FFFU);
        
        if((reg_temp1 == 0x00000000U) && (reg_temp2 == 0x00000000U) && (reg_temp3 == 0x00000000U)){
            trigger_temp = 0x1FU;
        }else{
            for(i = 0U; i < 0x0CU; i += 4U){
                if((REG32(timer_base_addr + i) & 0x7FFF7FFFU) != 0x00000000U){
                    reg_temp = REG32(timer_base_addr + i) & 0x7FFFU;
                    if(reg_temp == 0U){
                        reg_temp = (REG32(timer_base_addr + i) & 0x7FFF0000U) >> 16U;
                    }
                    for(j = 0; j < 15U; j += 5U){
                        trigger_temp = (reg_temp >> j) & 0x1FU;
                        if(trigger_temp != 0U){
                            break;
                        }
                    }
                    REG32(timer_base_addr + i) = 0x00000000U;
                    break;
                }
            }
        }
        REG32(timerxcfg_addr) = trigger_temp << trigger_off;
    }
}

/*!
    \brief      configure TIMER master slave mode (API_ID(0x0042U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  masterslave: master slave mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MASTER_SLAVE_MODE_ENABLE: master slave mode enable
      \arg        TIMER_MASTER_SLAVE_MODE_DISABLE: master slave mode disable
    \param[out] none
    \retval     none
*/
void timer_master_slave_mode_config(uint32_t timer_periph, uint32_t masterslave)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0042U), ERR_PERIPH);
    } else if(NOT_TIMER_MASTER_SLAVE_MODE(masterslave)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0042U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_MASTER_SLAVE_MODE_ENABLE == masterslave) {
            TIMER_SMCFG(timer_periph) |= (uint32_t)TIMER_SMCFG_MSM;
        } else if(TIMER_MASTER_SLAVE_MODE_DISABLE == masterslave) {
            TIMER_SMCFG(timer_periph) &= ~(uint32_t)TIMER_SMCFG_MSM;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure TIMER external trigger source (API_ID(0x0043U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  ext_trg: timer external trigger
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXTERNAL_TRIGGER_0: timer external trigger 0
      \arg        TIMER_EXTERNAL_TRIGGER_1: timer external trigger 1
      \arg        TIMER_EXTERNAL_TRIGGER_2: timer external trigger 2
    \param[out] none
    \retval     none
*/
void timer_external_trigger_select(uint32_t timer_periph, uint32_t ext_trg)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0043U), ERR_PERIPH);
    } else if(NOT_TIMER_EXTERNAL_TRIGGER(ext_trg)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0043U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_SMCFG(timer_periph) &= ~TIMER_SMCFG_ETISEL;
        TIMER_SMCFG(timer_periph) |= ext_trg;
    }
}

/*!
    \brief      configure TIMER external trigger input (API_ID(0x0044U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  extprescaler: external trigger prescaler
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXT_TRI_PSC_OFF: no divided
      \arg        TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg        TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg        TIMER_EXT_TRI_PSC_DIV8: divided by 8
    \param[in]  extpolarity: external trigger polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETP_FALLING: active low or falling edge active
      \arg        TIMER_ETP_RISING: active high or rising edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_trigger_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0044U), ERR_PERIPH);
    } else if(NOT_TIMER_EXT_TRI_PSC(extprescaler)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0044U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_EXTPOLARITY(extpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0044U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_CHANNEL_EXTFILTER(extfilter)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0044U), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_SMCFG(timer_periph) &= (~(uint32_t)(TIMER_SMCFG_ETP | TIMER_SMCFG_ETPSC | TIMER_SMCFG_ETFC));
        TIMER_SMCFG(timer_periph) |= (uint32_t)(extprescaler | extpolarity);
        TIMER_SMCFG(timer_periph) |= (uint32_t)(extfilter << 8U);
    }
}

/*!
    \brief      configure TIMER quadrature decoder mode (API_ID(0x0045U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  decomode: quadrature decoder mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_QUAD_DECODER_MODE0: counter counts on CI0FE0 edge depending on CI1FE1 level
      \arg        TIMER_QUAD_DECODER_MODE1: counter counts on CI1FE1 edge depending on CI0FE0 level
      \arg        TIMER_QUAD_DECODER_MODE2: counter counts on both CI0FE0 and CI1FE1 edges depending on the level of the other input
    \param[in]  ic0polarity: input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[in]  ic1polarity: input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[out] none
    \retval     none
*/
void timer_quadrature_decoder_mode_config(uint32_t timer_periph, uint32_t decomode, uint16_t ic0polarity, uint16_t ic1polarity)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0045U), ERR_PERIPH);
    } else if(NOT_TIMER_QUAD_DECODER(decomode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0045U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_ICPOLARITY(ic0polarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0045U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_ICPOLARITY(ic1polarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0045U), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the quadrature decoder mode */
        timer_slave_mode_select(timer_periph, decomode);
        
        /* configure input capture selection */
        TIMER_CHCTL0(timer_periph) &= (uint32_t)(((~(uint32_t)TIMER_CHCTL0_CH0MS)) & ((~(uint32_t)TIMER_CHCTL0_CH1MS)));
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(TIMER_IC_SELECTION_DIRECTTI | ((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U));
        /* configure channel input capture polarity */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)ic0polarity | ((uint32_t)ic1polarity << 4U));
    }
}

/*!
    \brief      quadrature decoder signal disconnection detection watchdog value config (API_ID(0x0046U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  value: watchdog counter period value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_watchdog_value_config(uint32_t timer_periph, uint32_t value)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0046U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_WDGPER(timer_periph) = value;
    }
}

/*!
    \brief      read quadrature decoder signal disconnection detection watchdog value (API_ID(0x0047U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     watchdog counter period register value, 0~0xFFFFFFFF
*/
uint32_t timer_watchdog_value_read(uint32_t timer_periph)
{
    uint32_t watchdog_value = 0;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0047U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        watchdog_value = (TIMER_WDGPER(timer_periph));
    }
    return watchdog_value;
}

/*!
    \brief      configure quadrature decoder signal disconnection detection function (API_ID(0x0048U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_disconnection_detection_config(uint32_t timer_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0048U), ERR_PERIPH);
    } else if(NOT_TIMER_NEWVALUE(newvalue)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0048U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            TIMER_CTL2(timer_periph) |= TIMER_CTL2_DECDISDEN;
        } else {
            TIMER_CTL2(timer_periph) &= (~TIMER_CTL2_DECDISDEN);
        }
    }
}

/*!
    \brief      configure quadrature decoder signal jump detection function (API_ID(0x0049U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_jump_detection_config(uint32_t timer_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0049U), ERR_PERIPH);
    } else if(NOT_TIMER_NEWVALUE(newvalue)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0049U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            TIMER_CTL2(timer_periph) |= TIMER_CTL2_DECJDEN;
        } else {
            TIMER_CTL2(timer_periph) &= (~TIMER_CTL2_DECJDEN);
        }
    }
}

/*!
    \brief      configure TIMER internal clock mode (API_ID(0x004AU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_internal_clock_config(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004AU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_DISABLE);
    }
}

/*!
    \brief      configure TIMER the internal trigger as external clock input (API_ID(0x004BU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  intrigger: internal trigger selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0
      \arg        TIMER_SMCFG_TRGSEL_ITI1: internal trigger 1
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2
      \arg        TIMER_SMCFG_TRGSEL_ITI3: internal trigger 3
      \arg        TIMER_SMCFG_TRGSEL_ITI4 :internal trigger 4
      \arg        TIMER_SMCFG_TRGSEL_ITI5 :internal trigger 5
      \arg        TIMER_SMCFG_TRGSEL_ITI6 :internal trigger 6
      \arg        TIMER_SMCFG_TRGSEL_ITI7 :internal trigger 7
      \arg        TIMER_SMCFG_TRGSEL_ITI8 :internal trigger 8
      \arg        TIMER_SMCFG_TRGSEL_ITI9 :internal trigger 9
    \param[out] none
    \retval     none
*/
void timer_internal_trigger_as_external_clock_config(uint32_t timer_periph, uint32_t intrigger)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004BU), ERR_PERIPH);
    } else if(NOT_TIMER_INTRIGGER(intrigger)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* select TIMER slave mode */
        timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_EXTERNAL0);
        /* select TIMER input trigger source */
        timer_input_trigger_source_select(timer_periph, intrigger);
    }
}

/*!
    \brief      configure TIMER the external trigger as external clock input (API_ID(0x004CU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  extrigger: external trigger selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_CI0F_ED: TI0 edge detector
      \arg        TIMER_SMCFG_TRGSEL_CI0FE0: filtered channel 0 input
      \arg        TIMER_SMCFG_TRGSEL_CI1FE1: filtered channel 1 input
    \param[in]  extpolarity: external input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: active high or rising edge active
      \arg        TIMER_IC_POLARITY_FALLING: active low or falling edge active
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_trigger_as_external_clock_config(uint32_t timer_periph, uint32_t extrigger, uint16_t extpolarity, uint32_t extfilter)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004CU), ERR_PERIPH);
    } else if(NOT_TIMER_EXTRIGGER(extrigger)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004CU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_ICPOLARITY(extpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004CU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_CHANNEL_EXTFILTER(extfilter)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004CU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_SMCFG_TRGSEL_CI1FE1 == extrigger) {
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            /* reset the CH1P and MCH1P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
            /* set the CH1P and MCH1P bits */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)extpolarity << 4U);
            /* reset the CH1MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            /* set the CH1MS bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U);
            /* reset the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            /* set the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(extfilter << 12U);
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
        } else {
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* reset the CH0P and MCH0P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
            /* set the CH0P and MCH0P bits */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)extpolarity;
            /* reset the CH0MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
            /* set the CH0MS bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)TIMER_IC_SELECTION_DIRECTTI;
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(extfilter << 4U);
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
        }
        
        /* select TIMER slave mode */
        timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_EXTERNAL0);
        /* select TIMER input trigger source */
        timer_input_trigger_source_select(timer_periph, extrigger);
    }
}

/*!
    \brief      configure TIMER the external clock mode0 (API_ID(0x004DU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  extprescaler: external trigger prescaler
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXT_TRI_PSC_OFF: no divided
      \arg        TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg        TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg        TIMER_EXT_TRI_PSC_DIV8: divided by 8
    \param[in]  extpolarity: external input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETP_FALLING: active low or falling edge active
      \arg        TIMER_ETP_RISING: active high or rising edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_clock_mode0_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004DU), ERR_PERIPH);
    } else if(NOT_TIMER_EXT_TRI_PSC(extprescaler)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004DU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_EXTPOLARITY(extpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004DU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_CHANNEL_EXTFILTER(extfilter)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004DU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure TIMER external trigger input */
        timer_external_trigger_config(timer_periph, extprescaler, extpolarity, extfilter);
        /* select TIMER slave mode */
        timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_EXTERNAL0);
        /* select TIMER input trigger source */
        timer_input_trigger_source_select(timer_periph, TIMER_SMCFG_TRGSEL_ETIFP);
    }
}

/*!
    \brief      configure TIMER the external clock mode1 (API_ID(0x004EU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  extprescaler: external trigger prescaler
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXT_TRI_PSC_OFF: no divided
      \arg        TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg        TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg        TIMER_EXT_TRI_PSC_DIV8: divided by 8
    \param[in]  extpolarity: external input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETP_FALLING: active low or falling edge active
      \arg        TIMER_ETP_RISING: active high or rising edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_clock_mode1_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004EU), ERR_PERIPH);
    } else if(NOT_TIMER_EXT_TRI_PSC(extprescaler)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_EXTPOLARITY(extpolarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004EU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_CHANNEL_EXTFILTER(extfilter)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004EU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure TIMER external trigger input */
        timer_external_trigger_config(timer_periph, extprescaler, extpolarity, extfilter);
        TIMER_SMCFG(timer_periph) |= (uint32_t)TIMER_SMCFG_SMC1;
    }
}

/*!
    \brief      disable TIMER the external clock mode1 (API_ID(0x004FU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_external_clock_mode1_disable(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x004FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
    TIMER_SMCFG(timer_periph) &= ~(uint32_t)TIMER_SMCFG_SMC1;
    }
}

/*!
    \brief    configure TIMER channel input remap function (API_ID(0x0050U))
    \param[in]  timer_periph: TIMERx(x=1,2)
    \param[in]  remap: TIMER channel input remap
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CI0_RMP_GPIO: TIMER channel 0 input remap to GPIO pin
      \arg        TIMER_CI0_RMP_LXTAL: TIMER channel 0 input remap to LXTAL
      \arg        TIMER_CI0_RMP_HXTAL: TIMER channel 0 input remap to HXTAL/128
      \arg        TIMER_CI0_RMP_CKOUT0SEL: TIMER channel 0 input remap to CKOUT0SEL
    \param[out] none
    \retval     none
*/
void timer_channel_remap_config(uint32_t timer_periph, uint32_t remap)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0050U), ERR_PERIPH);
    } else if(NOT_TIMER_REMAP(remap)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0050U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_IRMP(timer_periph) = (uint32_t)remap;
    }
}

/*!
    \brief      configure TIMER write CHxVAL register selection (API_ID(0x0051U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  ccsel: write CHxVAL register selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CHVSEL_DISABLE: no effect
      \arg        TIMER_CHVSEL_ENABLE: when write the CHxVAL register, if the write value is same as the CHxVAL value, the write access is ignored
    \param[out] none
    \retval     none
*/
void timer_write_chxval_register_config(uint32_t timer_periph, uint16_t ccsel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0051U), ERR_PERIPH);
    } else if(NOT_TIMER_CCSEL(ccsel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0051U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_CHVSEL_ENABLE == ccsel) {
            TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CHVSEL;
        } else if(TIMER_CHVSEL_DISABLE == ccsel) {
            TIMER_CFG(timer_periph) &= ~(uint32_t)TIMER_CFG_CHVSEL;
        } else {
            /* illegal parameters */
        }
    }
}

