sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
/*!
    \brief      configure TIMER output value selection (API_ID(0x0052U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  outsel: output value selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OUTSEL_DISABLE: no effect
      \arg        TIMER_OUTSEL_ENABLE: if POEN and IOS is 0, the output disabled
    \param[out] none
    \retval     none
*/
void timer_output_value_selection_config(uint32_t timer_periph, uint16_t outsel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0052U), ERR_PERIPH);
    } else if(NOT_TIMER_OUTSEL(outsel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0052U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_OUTSEL_ENABLE == outsel) {
            TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_OUTSEL;
        } else {
            TIMER_CFG(timer_periph) &= ~(uint32_t)TIMER_CFG_OUTSEL;
        }
    }
}

/*!
    \brief      configure TIMER commutation control shadow update config (API_ID(0x0053U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  outsel: output value selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CCUSEL_DISABLE: no effect
      \arg        TIMER_CCUSEL_ENABLE: if POEN and IOS is 0, the output disabled
    \param[out] none
    \retval     none
*/
void timer_commutation_control_shadow_update_config(uint32_t timer_periph, uint16_t ccusel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0053U), ERR_PERIPH);
    } else if(NOT_TIMER_CCUSEL(ccusel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0053U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_CCUSEL_ENABLE == ccusel) {
            TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CCUSEL;
        } else {
            TIMER_CFG(timer_periph) &= ~(uint32_t)TIMER_CFG_CCUSEL;
        }
    }
}


/*!
    \brief      configure TIMER read selection (API_ID(0x0054U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19,20,60,61,62,63)
    \param[in]  outsel: output value selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_RDSEL_DISABLE: no effect
      \arg        TIMER_RDSEL_ENABLE: if POEN and IOS is 0, the output disabled
    \param[out] none
    \retval     none
*/
void timer_read_selection_config(uint32_t timer_periph, uint16_t rdsel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0054U), ERR_PERIPH);
    } else if(NOT_TIMER_RDSEL(rdsel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0054U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_RDSEL_ENABLE == rdsel) {
            TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_RDSEL;
        } else if(TIMER_RDSEL_DISABLE == rdsel) {
            TIMER_CFG(timer_periph) &= ~(uint32_t)TIMER_CFG_RDSEL;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure TIMER output match pulse selection (API_ID(0x0055U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_CH_1: TIMER channel 1(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_CH_2: TIMER channel 2(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_CH_3: TIMER channel 3(x=0,7,19,20,60,61,62,63)
    \param[in]  pulsesel: output match pulse selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_PULSE_OUTPUT_NORMAL: channel output normal
      \arg        TIMER_PULSE_OUTPUT_CNT_UP: pulse output only when counting up
      \arg        TIMER_PULSE_OUTPUT_CNT_DOWN: pulse output only when counting down
      \arg        TIMER_PULSE_OUTPUT_CNT_BOTH: pulse output when counting up or down
    \param[out] none
    \retval     none
*/
void timer_output_match_pulse_select(uint32_t timer_periph, uint32_t channel, uint16_t pulsesel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0055U), ERR_PERIPH);
    } else if(NOT_TIMER_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0055U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_PLUSE_OUTPUT(pulsesel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0055U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        reg  = TIMER_CTL2(timer_periph);

        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 8U));
            reg |= (uint32_t)((uint32_t)pulsesel << 8U);
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 10U));
            reg |= (uint32_t)((uint32_t)pulsesel << 10U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 12U));
            reg |= (uint32_t)((uint32_t)pulsesel << 12U);
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 14U));
            reg |= (uint32_t)((uint32_t)pulsesel << 14U);
            break;
        default:
            break;
        }
        TIMER_CTL2(timer_periph) = reg;
    }
}

/*!
    \brief      configure the TIMER Asymmetric PWM mode (API_ID(0x0056U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_1: TIMER channel 1(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_2: TIMER channel 2(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_3: TIMER channel 3(x=0~2,7,19~20,60~63)
    \param[in]  pwmasymode: TIMER_OC_MODE_ASYM_PWM0,TIMER_OC_MODE_ASYM_PWM1
    \param[in]  newvalue: ENABLE, DISABLE
    \param[in]  dir: TIMER_CTL0_CAM_CENTER_DOWN,TIMER_CTL0_CAM_CENTER_UP,TIMER_CTL0_CAM_CENTER_BOTH
    \param[in]  capval: CHxVAL(CCRx) value
    \param[in]  addval: CHxCOMVAL_ADD value
    \param[out] none
    \retval     none
*/
void timer_channel_asymmetric_pwm_mode_config(uint32_t timer_periph,uint32_t channel, timer_channel_asymmetric_pwm_mode_struct *asymmetric_pwm_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0056U), ERR_PERIPH);
    } else if(NOT_TIMER_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0056U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_PWMASYMODE(asymmetric_pwm_para->pwmasymode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0056U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_NEWVALUE(asymmetric_pwm_para->enable)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0056U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_PWMASYMODE_DIR(asymmetric_pwm_para->dir)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0056U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((ENABLE == asymmetric_pwm_para->enable) && (asymmetric_pwm_para->dir != TIMER_CTL0_CAM_EDGE)) {
            TIMER_CTL0(timer_periph) |= CTL0_CAM(asymmetric_pwm_para->dir);
            if(channel == TIMER_CH_0) {
                TIMER_CHCTL0(timer_periph) &= ~(TIMER_CHCTL0_CH0MS | TIMER_CHCTL0_CH0COMCTL);
                TIMER_CHCTL0(timer_periph) |= asymmetric_pwm_para->pwmasymode;
              TIMER_CH0CV(timer_periph) = asymmetric_pwm_para->capval;
              TIMER_CH0CV_ADD(timer_periph) = asymmetric_pwm_para->addval;
            }else if(channel == TIMER_CH_1) {
                TIMER_CHCTL0(timer_periph) &= ~(TIMER_CHCTL0_CH1MS | TIMER_CHCTL0_CH1COMCTL);
                TIMER_CHCTL0(timer_periph) |= (asymmetric_pwm_para->pwmasymode << 8);
                TIMER_CH1CV(timer_periph) = asymmetric_pwm_para->capval;
                TIMER_CH1CV_ADD(timer_periph) = asymmetric_pwm_para->addval;
            }else if(channel == TIMER_CH_2) {
                TIMER_CHCTL1(timer_periph) &= ~(TIMER_CHCTL1_CH2MS | TIMER_CHCTL1_CH2COMCTL);
                TIMER_CHCTL1(timer_periph) |= (asymmetric_pwm_para->pwmasymode);
                TIMER_CH2CV(timer_periph) = asymmetric_pwm_para->capval;
                TIMER_CH2CV_ADD(timer_periph) = asymmetric_pwm_para->addval;
            } else {
                TIMER_CHCTL1(timer_periph) &= ~(TIMER_CHCTL1_CH3MS | TIMER_CHCTL1_CH3COMCTL);
                TIMER_CHCTL1(timer_periph) |= (asymmetric_pwm_para->pwmasymode << 8);
                TIMER_CH3CV(timer_periph) = asymmetric_pwm_para->capval;
                TIMER_CH3CV_ADD(timer_periph) = asymmetric_pwm_para->addval;
            }
        }
    }

