sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
}

/*!
    \brief      configure the TIMER composite PWM mode output pulse value (API_ID(0x0057U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_1: TIMER channel 1(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_2: TIMER channel 2(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_3: TIMER channel 3(x=0~2,7,19~20,60~63)
      \arg        TIMER_MCH_0: TIMER channel 0(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_1: TIMER channel 1(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_2: TIMER channel 2(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_3: TIMER channel 3(x=0,7,19~20,60~63)
    \param[in]  pulse: channel compare value, 0~65535
    \param[in]  add_pulse: channel additional compare value, 0~65535
    \param[out] none
    \retval     none
*/
void timer_channel_composite_pwm_mode_output_pulse_value_config(uint32_t timer_periph, uint32_t channel, uint32_t pulse, uint32_t add_pulse)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0057U), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0057U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CH0CV(timer_periph) = (uint32_t)pulse;
            TIMER_CH0CV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CH1CV(timer_periph) = (uint32_t)pulse;
            TIMER_CH1CV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CH2CV(timer_periph) = (uint32_t)pulse;
            TIMER_CH2CV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CH3CV(timer_periph) = (uint32_t)pulse;
            TIMER_CH3CV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCH0CV(timer_periph) = (uint32_t)pulse;
            TIMER_MCH0CV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCH1CV(timer_periph) = (uint32_t)pulse;
            TIMER_MCH1CV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCH2CV(timer_periph) = (uint32_t)pulse;
            TIMER_MCH2CV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCH3CV(timer_periph) = (uint32_t)pulse;
            TIMER_MCH3CV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        default:
            break;
        }
    }
}


/*!
    \brief      configure TIMER channel additional compare value (API_ID(0x0058U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_1: TIMER channel 1(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_2: TIMER channel 2(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_3: TIMER channel 3(x=0~2,7,19~20,60~63)
      \arg        TIMER_MCH_0: TIMER channel 0(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_1: TIMER channel 1(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_2: TIMER channel 2(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_3: TIMER channel 3(x=0,7,19~20,60~63)
    \param[in]  value: channel additional compare value, 0~65535
    \param[out] none
    \retval     none
*/
void timer_channel_additional_compare_value_config(uint32_t timer_periph, uint16_t channel, uint32_t value)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0058U), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0058U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CH0CV_ADD(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CH1CV_ADD(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CH2CV_ADD(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CH3CV_ADD(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCH0CV_ADD(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCH1CV_ADD(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCH2CV_ADD(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCH3CV_ADD(timer_periph) = (uint32_t)value;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      read TIMER channel additional compare value (API_ID(0x0059U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_1: TIMER channel 1(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_2: TIMER channel 2(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_3: TIMER channel 3(x=0~2,7,19~20,60~63)
      \arg        TIMER_MCH_0: TIMER channel 0(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_1: TIMER channel 1(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_2: TIMER channel 2(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_3: TIMER channel 3(x=0,7,19~20,60~63)
    \param[out] none
    \retval     timer additional compare value, 0~0xFFFF
*/
uint16_t timer_channel_additional_compare_value_read(uint32_t timer_periph, uint16_t channel)
{
    uint16_t counter = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0059U), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0059U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            counter = (uint16_t)TIMER_CH0CV_ADD(timer_periph);
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            counter = (uint16_t)TIMER_CH1CV_ADD(timer_periph);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            counter = (uint16_t)TIMER_CH2CV_ADD(timer_periph);
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            counter = (uint16_t)TIMER_CH3CV_ADD(timer_periph);
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            counter = (uint16_t)TIMER_MCH0CV_ADD(timer_periph);
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            counter = (uint16_t)TIMER_MCH1CV_ADD(timer_periph);
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            counter = (uint16_t)TIMER_MCH2CV_ADD(timer_periph);
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            counter = (uint16_t)TIMER_MCH3CV_ADD(timer_periph);
            break;
        default:
            break;
        }
    }
    return (uint16_t)counter;
}

/*!
    \brief      configure TIMER channel additional output shadow function (API_ID(0x005AU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_1: TIMER channel 1(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_2: TIMER channel 2(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_3: TIMER channel 3(x=0~2,7,19~20,60~63)
      \arg        TIMER_MCH_0: TIMER channel 0(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_1: TIMER channel 1(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_2: TIMER channel 2(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_3: TIMER channel 3(x=0,7,19~20,60~63)
    \param[in]  aocshadow: channel additional output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ADD_SHADOW_ENABLE: channel additional output compare shadow enable
      \arg        TIMER_ADD_SHADOW_DISABLE: channel additional output compare shadow disable
    \param[out] none
    \retval     none
*/
void timer_channel_additional_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t aocshadow)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005AU), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005AU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_ADD_SHADOW(aocshadow)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005AU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMADDSEN);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 28U);
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMADDSEN);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 29U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMADDSEN);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 28U);
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMADDSEN);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 29U);
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMADDSEN);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 28U);
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMADDSEN);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 29U);
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMADDSEN);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 28U);
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMADDSEN);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 29U);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      select TIMER channel additional output shadow register update source (API_ID(0x005BU))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_1: TIMER channel 1(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_2: TIMER channel 2(x=0~2,7,19~20,60~63)
      \arg        TIMER_CH_3: TIMER channel 3(x=0~2,7,19~20,60~63)
      \arg        TIMER_MCH_0: TIMER channel 0(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_1: TIMER channel 1(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_2: TIMER channel 2(x=0,7,19~20,60~63)
      \arg        TIMER_MCH_3: TIMER channel 3(x=0,7,19~20,60~63)
    \param[in]  update: channel additional output compare shadow update
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ADD_SHADOW_SELECT_UPDATE: channel additional output shadow register update by update event
      \arg        TIMER_ADD_SHADOW_SELECT_CMP_MATCH: channel additional output shadow register update by compare value match
    \param[out] none
    \retval     none
*/
void timer_channel_additional_output_update_select(uint32_t timer_periph, uint16_t channel, uint16_t update)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005BU), ERR_PERIPH);
    } else if(NOT_TIMER_ALL_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005BU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_ADD_SHADOW_SELECT(update)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005BU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0ADDUPS);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)update << 26U);
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1ADDUPS);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)update << 27U);
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH2ADDUPS);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)update << 26U);
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH3ADDUPS);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)update << 27U);
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0ADDUPS);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)((uint32_t)update << 26U);
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1ADDUPS);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)((uint32_t)update << 27U);
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2ADDUPS);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)((uint32_t)update << 26U);
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3ADDUPS);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)((uint32_t)update << 27U);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      initialize TIMER break external input parameter struct with a default value (API_ID(0x005CU))
    \param[in]  breakinpara: TIMER break external input parameter struct
    \param[out] none
    \retval     none
*/
void timer_break_external_input_struct_para_init(timer_break_ext_input_struct *breakinpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(breakinpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005CU), ERR_PARAM_POINTER);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the break parameter struct member with the default value */
        breakinpara->filter   = 0U;
        breakinpara->enable   = DISABLE;
        breakinpara->polarity = TIMER_BRKIN_POLARITY_LOW;
    }
}

/*!
    \brief      configure break external input (API_ID(0x005DU))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  break_input: break external input
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAKINPUT_BRK0: TIMER break external input 0
      \arg        TIMER_BREAKINPUT_BRK1: TIMER break external input 1
      \arg        TIMER_BREAKINPUT_BRK2: TIMER break external input 2
      \arg        TIMER_BREAKINPUT_BRK3: TIMER break external input 3
    \param[in]  breakinpara: break external input parameter struct
                  filter:: 0~15
                  enable: ENABLE or DISABLE
                  polarity: TIMER_BRKIN_POLARITY_HIGH, TIMER_BRKIN_POLARITY_LOW
    \param[out] none
    \retval     none
*/
void timer_break_external_input_config(uint32_t timer_periph, uint32_t break_input, timer_break_ext_input_struct *breakinpara)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005DU), ERR_PERIPH);
    } else if(NOT_TIMER_BREAKINPUT(break_input)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005DU), ERR_PARAM_INVALID);
    } else if(NOT_VALID_POINTER(breakinpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005DU), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_BREAK_FILTERE_VALUE(breakinpara->filter)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005DU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_TIMER_NEWVALUE(breakinpara->enable)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005DU), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_BRKIN_POLARITY(breakinpara->polarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = TIMER_BRKCFG(timer_periph);
        reg &= (~(uint32_t)((0x03000000U << (break_input << 1U) | ((uint32_t)0x0000000FU << (break_input << 2U)))));

        reg |= ((breakinpara->filter   << (break_input << 2U)) |
                ((uint32_t)breakinpara->enable   << ((break_input << 1U) + 24U)) |
                (breakinpara->polarity << ((break_input << 1U) + 25U)));
        TIMER_BRKCFG(timer_periph) = reg;
    }
}

/*!
    \brief      break external input enable (API_ID(0x005EU))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  break_input: break external input
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAKINPUT_BRK0: TIMER break external input 0
      \arg        TIMER_BREAKINPUT_BRK1: TIMER break external input 1
      \arg        TIMER_BREAKINPUT_BRK2: TIMER break external input 2
      \arg        TIMER_BREAKINPUT_BRK3: TIMER break external input 3
    \param[out] none
    \retval     none
*/
void timer_break_external_input_enable(uint32_t timer_periph, uint32_t break_input)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005EU), ERR_PERIPH);
    } else if(NOT_TIMER_BREAKINPUT(break_input)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_BRKCFG(timer_periph) |= (uint32_t)(TIMER_BRKCFG_BRK0EN << (break_input << 1U));
    }
}

/*!
    \brief      break external input disable (API_ID(0x005FU))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  break_input: break external input
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAKINPUT_BRK0: TIMER break external input 0
      \arg        TIMER_BREAKINPUT_BRK1: TIMER break external input 1
      \arg        TIMER_BREAKINPUT_BRK2: TIMER break external input 2
      \arg        TIMER_BREAKINPUT_BRK3: TIMER break external input 3
    \param[out] none
    \retval     none
*/
void timer_break_external_input_disable(uint32_t timer_periph, uint32_t break_input)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005FU), ERR_PERIPH);
    } else if(NOT_TIMER_BREAKINPUT(break_input)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x005FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_BRKCFG(timer_periph) &= (~(uint32_t)(TIMER_BRKCFG_BRK0EN << (break_input << 1U)));
    }
}

/*!
    \brief      configure TIMER break external input polarity (API_ID(0x0060U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  break_input: break external input
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAKINPUT_BRK0: TIMER break external input 0(TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_BREAKINPUT_BRK1: TIMER break external input 1(TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_BREAKINPUT_BRK2: TIMER break external input 2(TIMERx(x=0,7,19,20,60,61,62,63)
      \arg        TIMER_BREAKINPUT_BRK3: TIMER break external input 3(TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  polarity: break external input polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKIN_POLARITY_HIGH: break external input polarity is high
      \arg        TIMER_BRKIN_POLARITY_LOW: break external input polarity is low
    \param[out] none
    \retval     none
*/
void timer_break_external_input_polarity_config(uint32_t timer_periph, uint32_t break_input, uint32_t polarity)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0060U), ERR_PERIPH);
    } else if(NOT_TIMER_BREAKINPUT(break_input)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0060U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_BRKIN_POLARITY(polarity)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0060U), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(polarity == TIMER_BRKIN_POLARITY_HIGH) {
            TIMER_BRKCFG(timer_periph) |= (uint32_t)(TIMER_BRKCFG_BRK0P << (break_input << 1U));
        } else {
            TIMER_BRKCFG(timer_periph) &= (~(uint32_t)(TIMER_BRKCFG_BRK0P << (break_input << 1U)));
        }
    }
}

