sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
/*!
    \brief      configure the TIMER channel break function (API_ID(0x0061U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_break_control_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
     if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0061U), ERR_PERIPH);
    } else if(NOT_TIMER_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0061U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_NEWVALUE(newvalue)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0061U), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_BRKENCH0 << channel);
        } else {
            TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_BRKENCH0 << channel));
        }
    }
}

/*!
    \brief      configure the TIMER deat time dead time shadow function (API_ID(0x0062U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_dead_time_shadow_config(uint32_t timer_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
     if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0062U), ERR_PERIPH);
    } else if(NOT_TIMER_NEWVALUE(newvalue)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0062U), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_DTSEN;
        } else {
            TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_DTSEN);
        }
    }
}

/*!
    \brief      configure the TIMER channel free dead time function (API_ID(0x0063U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_dead_time_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
     if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0063U), ERR_PERIPH);
    } else if(NOT_TIMER_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0063U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_NEWVALUE(newvalue)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0063U), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_DTIENCH0 << channel);
        } else {
            TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_DTIENCH0 << channel));
        }
    }
}

/*!
    \brief      initialize TIMER channel free complementary parameter struct with a default value (API_ID(0x0064U))
    \param[in]  none
    \param[out] freecompara: TIMER channel free complementary parameter struct
    \retval     none
*/
void timer_free_complementary_struct_para_init(timer_free_complementary_parameter_struct *freecompara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(freecompara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0064U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the channel free complementary parameter struct member with the default value */
        freecompara->freecomstate = TIMER_FCCHP_STATE_DISABLE;
        freecompara->runoffstate  = TIMER_ROS_STATE_DISABLE;
        freecompara->ideloffstate = TIMER_IOS_STATE_DISABLE;
        freecompara->deadtime     = 0U;
    }
}

/*!
    \brief      configure channel free complementary protection (API_ID(0x0065U))
    \param[in]  timer_periph: TIMERx(x=0,7,19,20,60,61,62,63)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in] fcpara: TIMER channel free complementary parameter struct
                freecomstate: TIMER_FCCHP_STATE_ENABLE, TIMER_FCCHP_STATE_DISABLE
                dtshadow: TIMER_DEADTIME0_SHADOW_ENABLE, TIMER_DEADTIME0_SHADOW_DISABLE
                runoffstate: TIMER_ROS_STATE_ENABLE, TIMER_ROS_STATE_DISABLE
                ideloffstate: TIMER_IOS_STATE_ENABLE, TIMER_IOS_STATE_DISABLE
                deadtime: 0~255
    \param[out] none
    \retval     none
*/
void timer_channel_free_complementary_config(uint32_t timer_periph, uint16_t channel, timer_free_complementary_parameter_struct *fcpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0065U), ERR_PERIPH);
    } else if(NOT_TIMER_CHANNEL(channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0065U), ERR_PARAM_INVALID);
    } else if(NOT_VALID_POINTER(fcpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0065U), ERR_PARAM_POINTER);
    } else if(NOT_TIMER_FREECOMSTATE(fcpara->freecomstate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0065U), ERR_PARAM_INVALID);
    }  else if(NOT_TIMER_RUNOFFSTATE(fcpara->runoffstate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0065U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_IDELOFFSTATE(fcpara->ideloffstate)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0065U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_BREAK_DEADTIME(fcpara->deadtime)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0065U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        case TIMER_CH_0:
            TIMER_FCCHP0(timer_periph) &= (~(uint32_t)(TIMER_FCCHP0_DTCFG | TIMER_FCCHP0_IOS | TIMER_FCCHP0_ROS | TIMER_FCCHP0_DT0SEN | TIMER_FCCHP0_FCCHP0EN));
            TIMER_FCCHP0(timer_periph) |= fcpara->deadtime;
            TIMER_FCCHP0(timer_periph) |= fcpara->ideloffstate;
            TIMER_FCCHP0(timer_periph) |= fcpara->runoffstate;
            TIMER_FCCHP0(timer_periph) |= fcpara->dtshadow;
            TIMER_FCCHP0(timer_periph) |= fcpara->freecomstate;
            break;
        case TIMER_CH_1:
            TIMER_FCCHP1(timer_periph) &= (~(uint32_t)(TIMER_FCCHP1_DTCFG | TIMER_FCCHP1_IOS | TIMER_FCCHP1_ROS | TIMER_FCCHP1_DT1SEN | TIMER_FCCHP1_FCCHP1EN));
            TIMER_FCCHP1(timer_periph) |= fcpara->deadtime;
            TIMER_FCCHP1(timer_periph) |= fcpara->ideloffstate;
            TIMER_FCCHP1(timer_periph) |= fcpara->runoffstate;
            TIMER_FCCHP0(timer_periph) |= fcpara->dtshadow;
            TIMER_FCCHP1(timer_periph) |= fcpara->freecomstate;
            break;
        case TIMER_CH_2:
            TIMER_FCCHP2(timer_periph) &= (~(uint32_t)(TIMER_FCCHP2_DTCFG | TIMER_FCCHP2_IOS | TIMER_FCCHP2_ROS | TIMER_FCCHP2_DT2SEN | TIMER_FCCHP2_FCCHP2EN));
            TIMER_FCCHP2(timer_periph) |= fcpara->deadtime;
            TIMER_FCCHP2(timer_periph) |= fcpara->ideloffstate;
            TIMER_FCCHP2(timer_periph) |= fcpara->runoffstate;
            TIMER_FCCHP0(timer_periph) |= fcpara->dtshadow;
            TIMER_FCCHP2(timer_periph) |= fcpara->freecomstate;
            break;
        case TIMER_CH_3:
            TIMER_FCCHP3(timer_periph) &= (~(uint32_t)(TIMER_FCCHP3_DTCFG | TIMER_FCCHP3_IOS | TIMER_FCCHP3_ROS | TIMER_FCCHP3_DT3SEN | TIMER_FCCHP3_FCCHP3EN));
            TIMER_FCCHP3(timer_periph) |= fcpara->deadtime;
            TIMER_FCCHP3(timer_periph) |= fcpara->ideloffstate;
            TIMER_FCCHP3(timer_periph) |= fcpara->runoffstate;
            TIMER_FCCHP0(timer_periph) |= fcpara->dtshadow;
            TIMER_FCCHP3(timer_periph) |= fcpara->freecomstate;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure initial counter function (API_ID(0x0066U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  value: counter initial value, 0~0xFFFF
    \param[in]  direction: counter initial direction
              only one parameter can be selected which is shown as below:
      \arg        TIMER_INITIAL_DIRECTION_DOWN: counter count down when synchronizaton event occurs
      \arg        TIMER_INITIAL_DIRECTION_UP: counter count up when synchronizaton event occurs
    \param[out] none
    \retval     none
*/
void timer_initial_counter_config(uint32_t timer_periph, uint32_t value, uint32_t direction)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0066U), ERR_PERIPH);
    } else if(NOT_TIMER_INITIAL_COUNTER_VALUE(value)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0066U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_INITIAL_DIRECTION(direction)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0066U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CINITV(timer_periph) = (uint32_t)value;
        
        TIMER_CINITCTL(timer_periph) &= (~(uint32_t)TIMER_CINITCTL_CINITDIR);
        TIMER_CINITCTL(timer_periph) |= (uint32_t)direction;
    }
}

/*!
    \brief      configure counter initial value register (API_ID(0x0067U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_initial_counter_register_config(uint32_t timer_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0067U), ERR_PERIPH);
    } else if(NOT_TIMER_NEWVALUE(newvalue)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0067U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            TIMER_CINITCTL(timer_periph) |= TIMER_CINITCTL_CINITVEN;
        } else {
            TIMER_CINITCTL(timer_periph) &= (~(uint32_t)TIMER_CINITCTL_CINITVEN);
        }
    }
}

/*!
    \brief      generate soft synchronization event (API_ID(0x0068U))
    \param[in]  timer_periph: TIMERx(x=0~2,7,19~20,60~63)
    \param[out] none
    \retval     none
*/
void timer_synchronization_event_generate(uint32_t timer_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0068U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CINITCTL(timer_periph) |= TIMER_CINITCTL_SWSYNCG;
    }
}

/*!
    \brief     initialize TIMER counter (API_ID(0x0069U))
    \param[in] timer_periph: TIMERx(x=5,6)
    \param[in] timer_channel: TIMER basic channel
               only one parameter can be selected which is shown as below:
      \arg       TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg       TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg       TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg       TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[in] initpara: init parameter struct
                 prescaler: prescaler value of the counter clock, 0~65535
                 period: counter auto reload value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_basic_init(uint32_t timer_periph, uint32_t timer_channel, timer_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0069U), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0069U), ERR_PARAM_INVALID);
    }else if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0069U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the counter prescaler value */
        TIMER_BASIC_PSC(timer_periph, timer_channel) = (uint16_t)initpara->prescaler;

