sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
        /* configure the autoreload value */
        TIMER_BASIC_CAR(timer_periph, timer_channel) = (uint32_t)initpara->period;

        /* generate an update event */
        TIMER_SWEVG(timer_periph) |= (uint32_t)(TIMER_SWEVG_UPG0 << timer_channel);
    }
}

/*!
    \brief      enable a TIMER (API_ID(0x006AU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_enable(uint32_t timer_periph, uint32_t timer_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006AU), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= (uint32_t)(TIMER_CTL0_CEN0 << timer_channel);
    }
}

/*!
    \brief      disable a TIMER (API_ID(0x006BU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_disable(uint32_t timer_periph, uint32_t timer_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006BU), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= ~(uint32_t)(TIMER_CTL0_CEN0 << timer_channel);
    }
}

/*!
    \brief      enable the auto reload shadow function (API_ID(0x006CU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_auto_reload_shadow_enable(uint32_t timer_periph, uint32_t timer_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006CU), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= (uint32_t)(TIMER_CTL0_ARSE0 << timer_channel);
    }
}

/*!
    \brief      disable the auto reload shadow function (API_ID(0x006DU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_auto_reload_shadow_disable(uint32_t timer_periph, uint32_t timer_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006DU), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= ~(uint32_t)(TIMER_CTL0_ARSE0 << timer_channel);
    }
}

/*!
    \brief      enable the update event (API_ID(0x006EU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_update_event_enable(uint32_t timer_periph, uint32_t timer_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006EU), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) &= ~(uint32_t)(TIMER_CTL0_UPDIS0 << timer_channel);
    }
}

/*!
    \brief      disable the update event (API_ID(0x006FU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_update_event_disable(uint32_t timer_periph, uint32_t timer_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006FU), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x006FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_CTL0(timer_periph) |= (uint32_t) (TIMER_CTL0_UPDIS0 << timer_channel);
    }
}

/*!
    \brief      configure TIMER prescaler (API_ID(0x0070U))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[in]  prescaler: prescaler value, 0~65535
    \param[in]  pscreload: prescaler reload mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_PSC_RELOAD_NOW: the prescaler is loaded right now
      \arg        TIMER_PSC_RELOAD_UPDATE: the prescaler is loaded at the next update event
    \param[out] none
    \retval     none
*/
void timer_basic_prescaler_config(uint32_t timer_periph, uint32_t timer_channel, uint16_t prescaler, uint32_t pscreload)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0070U), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0070U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_PSCRELOAD(pscreload)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0070U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_BASIC_PSC(timer_periph, timer_channel) = (uint32_t)prescaler;

        if(TIMER_PSC_RELOAD_NOW == pscreload) {
            TIMER_SWEVG(timer_periph) |= (uint32_t)(TIMER_SWEVG_UPG0 << timer_channel);
        }
    }
}

/*!
    \brief      configure TIMER autoreload register value (API_ID(0x0071U))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[in]  autoreload: the counter auto-reload value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_basic_autoreload_value_config(uint32_t timer_periph, uint32_t timer_channel, uint32_t autoreload)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0071U), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0071U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_BASIC_CAR(timer_periph, timer_channel) = (uint32_t)autoreload;
    }
}

/*!
    \brief      get TIMER autoreload register value (API_ID(0x0072U))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     counter auto reload register value, 0~0xFFFFFFFF
*/
uint32_t timer_basic_autoreload_value_read(uint32_t timer_periph, uint32_t timer_channel)
{
    uint32_t autoreload = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0072U), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0072U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        autoreload =  TIMER_BASIC_CAR(timer_periph, timer_channel);
    }
    return autoreload;
}

/*!
    \brief      configure TIMER counter register value (API_ID(0x0073U))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[in]  counter: the counter value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_basic_counter_value_config(uint32_t timer_periph, uint32_t timer_channel, uint32_t counter)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0073U), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0073U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        TIMER_BASIC_CNT(timer_periph, timer_channel) = (uint32_t)counter;
    }
}

/*!
    \brief      read TIMER counter value (API_ID(0x0074U))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     counter value, 0~0xFFFFFFFF
*/
uint32_t timer_basic_counter_read(uint32_t timer_periph, uint32_t timer_channel)
{
    uint32_t count_value = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0074U), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0074U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        count_value = TIMER_BASIC_CNT(timer_periph, timer_channel);
    }
    return (count_value);
}

/*!
    \brief      read TIMER prescaler value (API_ID(0x0075U))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     prescaler register value, 0~65535
*/
uint16_t timer_basic_prescaler_read(uint32_t timer_periph, uint32_t timer_channel)
{
    uint16_t prescaler_value;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0075U), ERR_PERIPH);
        return 0;
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0075U), ERR_PARAM_INVALID);
        return 0;
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        prescaler_value = (uint16_t)(TIMER_BASIC_PSC(timer_periph, timer_channel));
    }
    return (prescaler_value);
}

/*!
    \brief      configure TIMER single pulse mode (API_ID(0x0076U))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[in]  spmode: single pulse mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SP_MODE_SINGLE: single pulse mode
      \arg        TIMER_SP_MODE_REPETITIVE: repetitive pulse mode
    \param[out] none
    \retval     none
*/
void timer_basic_single_pulse_mode_config(uint32_t timer_periph, uint32_t timer_channel, uint32_t spmode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0076U), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0076U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_SPMODE(spmode)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0076U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_SP_MODE_SINGLE == spmode) {
            TIMER_CTL0(timer_periph) |= (uint32_t)(TIMER_CTL0_SPM0 << timer_channel);
        } else if(TIMER_SP_MODE_REPETITIVE == spmode) {
            TIMER_CTL0(timer_periph) &= ~((uint32_t)(TIMER_CTL0_SPM0 << timer_channel));
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure TIMER update source (API_ID(0x0077U))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[in]  update: update source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATE_SRC_GLOBAL: update generate by setting of UPG bit or the counter overflow/underflow,
                                           or the slave mode controller trigger
      \arg        TIMER_UPDATE_SRC_REGULAR: update generate only by counter overflow/underflow
    \param[out] none
    \retval     none
*/
void timer_basic_update_source_config(uint32_t timer_periph, uint32_t timer_channel, uint32_t update)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0077U), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0077U), ERR_PARAM_INVALID);
    } else if(NOT_TIMER_UPDATE(update)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0077U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(TIMER_UPDATE_SRC_REGULAR == update) {
            TIMER_CTL0(timer_periph) |= (uint32_t)(TIMER_CTL0_UPS0 << timer_channel);
        } else if(TIMER_UPDATE_SRC_GLOBAL == update) {
            TIMER_CTL0(timer_periph) &= ~(uint32_t)(TIMER_CTL0_UPS0 << timer_channel);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable the TIMER DMA (API_ID(0x0078U))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  dma: specify which DMA to enable
                only one parameter can be selected which are shown as below:
      \arg        TIMER_DMA_UPD0:  update DMA request of channel 0
      \arg        TIMER_DMA_UPD1:  update DMA request of channel 1
      \arg        TIMER_DMA_UPD2:  update DMA request of channel 2
      \arg        TIMER_DMA_UPD3:  update DMA request of channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_dma_enable(uint32_t timer_periph, uint32_t dma)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0078U), ERR_PERIPH);
    } else if(NOT_BASIC_TIMER_DMA(dma)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0078U), ERR_PARAM_INVALID);
    } else
#endif
    {
        TIMER_DMAINTEN(timer_periph) |= (uint32_t) dma;
    }
}

/*!
    \brief      disable the TIMER DMA (API_ID(0x0079U))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  dma: specify which DMA to enable
                only one parameter can be selected which are shown as below:
      \arg        TIMER_DMA_UPD0:  update DMA request of channel 0
      \arg        TIMER_DMA_UPD1:  update DMA request of channel 1
      \arg        TIMER_DMA_UPD2:  update DMA request of channel 2
      \arg        TIMER_DMA_UPD3:  update DMA request of channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_dma_disable(uint32_t timer_periph, uint32_t dma)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0079U), ERR_PERIPH);
    } else if(NOT_BASIC_TIMER_DMA(dma)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0079U), ERR_PARAM_INVALID);
    } else
#endif
    {
        TIMER_DMAINTEN(timer_periph) &= (~(uint32_t)(dma));
    }
}

/*!
    \brief      software generate events (API_ID(0x007AU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  event: the timer software event generation sources
                only one parameter can be selected which are shown as below:
      \arg        TIMER_EVENT_SRC_UPG0: update event generation of channel 0
      \arg        TIMER_EVENT_SRC_UPG1: update event generation of channel 1
      \arg        TIMER_EVENT_SRC_UPG2: update event generation of channel 2
      \arg        TIMER_EVENT_SRC_UPG3: update event generation of channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_event_software_generate(uint32_t timer_periph, uint32_t event)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007AU), ERR_PERIPH);
    } else if(NOT_BASIC_TIMER_EVENT(event)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007AU), ERR_PARAM_INVALID);
    } else
#endif
    {
        TIMER_SWEVG(timer_periph) |= (uint32_t)event;
    }
}

/*!
    \brief      enable basic TIMER cascade mode (API_ID(0x007BU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_cascade_mode_enable(uint32_t timer_periph, uint32_t timer_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007BU), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(timer_channel == TIMER_BASIC_CHANNEL_1){
            TIMER_CTL1(timer_periph) |= TIMER_CTL1_CASC1;
        }else if(timer_channel == TIMER_BASIC_CHANNEL_2){
            TIMER_CTL1(timer_periph) |= TIMER_CTL1_CASC2;
        }else{
            TIMER_CTL1(timer_periph) |= TIMER_CTL1_CASC3;
        }
    }
}

/*!
    \brief      disable basic TIMER cascade mode (API_ID(0x007CU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[out] none
    \retval     none
*/
void timer_basic_cascade_mode_disable(uint32_t timer_periph, uint32_t timer_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007CU), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(timer_channel == TIMER_BASIC_CHANNEL_1){
            TIMER_CTL1(timer_periph) &= ~ TIMER_CTL1_CASC1;
        }else if(timer_channel == TIMER_BASIC_CHANNEL_2){
            TIMER_CTL1(timer_periph) &= ~TIMER_CTL1_CASC2;
        }else{
            TIMER_CTL1(timer_periph) &= ~ TIMER_CTL1_CASC3;
        }
    }
}

/*!
    \brief      read basic timer cascade counter value (API_ID(0x007DU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[out] none
    \retval     counter value, 0~0xFFFFFFFFFFFFFFFF
*/
uint64_t timer_basic_cascade_counter_read(uint32_t timer_periph)
{
    uint64_t counter;
    uint64_t high_value;
    uint64_t low_value;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007DU), ERR_PERIPH);
        return 0;
    } else
#endif
    {
        high_value = ((uint64_t)TIMER_CASCH(timer_periph) << 32U);
        low_value = (uint64_t)TIMER_CASCL(timer_periph);
        counter = (high_value | low_value);
    }
    return counter;
}

