sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
/*!
    \brief      select TIMER master channel mode output trigger source (API_ID(0x007EU))
    \param[in]  timer_periph: TIMERx(x=5,6)
    \param[in]  timer_channel: TIMER basic channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BASIC_CHANNEL_0: TIMER basic channel 0
      \arg        TIMER_BASIC_CHANNEL_1: TIMER basic channel 1
      \arg        TIMER_BASIC_CHANNEL_2: TIMER basic channel 2
      \arg        TIMER_BASIC_CHANNEL_3: TIMER basic channel 3
    \param[in]  outtrigger: trigger output source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_TRI_OUT_SRC_RESET: the UPG bit as trigger output
      \arg        TIMER_TRI_OUT_SRC_ENABLE: the counter enable signal as trigger output
      \arg        TIMER_TRI_OUT_SRC_UPDATE: update event as trigger output
    \param[out] none
    \retval     none
*/
void timer_basic_master_output_trigger_source_select(uint32_t timer_periph, uint32_t timer_channel, uint32_t outtrigger)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BASIC_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007EU), ERR_PERIPH);
    } else if(NOT_TIMER_BAISC_CHANNEL(timer_channel)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007EU), ERR_PARAM_INVALID);
    } else if(NOT_BASIC_TIMER_OUTTRIGGER(outtrigger)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007EU), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

        outtrigger >>= 4U;
        reg  = TIMER_CTL1(timer_periph);
        reg &= (~(uint32_t)(TIMER_CTL1_MMC0 << (timer_channel * 4U)));
        reg |= (uint32_t)(outtrigger << (timer_channel * 4U));
        TIMER_CTL1(timer_periph) = reg;
    }
}

/*!
    \brief      get TIMER flags (API_ID(0x007FU))
    \param[in]  timer_periph: TIMERx(x=0~2,5~7,19~20,60~63)
    \param[in]  int_flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH0: channel 0 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH1: channel 1 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH2: channel 2 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH3: channel 3 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_TRG: trigger interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_BRK: BREAK interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_DECJ: quadrature decoder signal jump interrupt flag, TIMERx(x=1~2)
      \arg        TIMER_FLAG_DECDIS: quadrature decoder signal disconnection interrupt flag, TIMERx(x=1~2)
      \arg        TIMER_FLAG_MCH0: multi mode channel 0 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH1: multi mode channel 1 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH2: multi mode channel 2 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH3: multi mode channel 3 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_CH0COMADD: channel 0 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH1COMADD: channel 1 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH2COMADD: channel 2 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH3COMADD: channel 3 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH0COMADD: multi mode channel 0 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH1COMADD: multi mode channel 1 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH2COMADD: multi mode channel 2 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH3COMADD: multi mode channel 3 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_UP0: update interrupt flag of timer channel 0, TIMERx(x=5~6)
      \arg        TIMER_FLAG_UP1: update interrupt flag of timer channel 1, TIMERx(x=5~6)
      \arg        TIMER_FLAG_UP2: update interrupt flag of timer channel 2, TIMERx(x=5~6)
      \arg        TIMER_FLAG_UP3: update interrupt flag of timer channel 3, TIMERx(x=5~6)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_flag_get(uint32_t timer_periph, uint32_t flag)
{
    FlagStatus timer_flag = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007FU), ERR_PERIPH);
    } else if(NOT_TIMER_FLAG(flag)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x007FU), ERR_PARAM_INVALID);
    } else
#endif
    {
        if((uint32_t)RESET != (TIMER_INTF(timer_periph) & flag)) {
            timer_flag = SET;
        } else {
            timer_flag = RESET;
        }
    }
    return timer_flag;
}

/*!
    \brief      clear TIMER flags (API_ID(0x0080U))
    \param[in]  timer_periph: TIMERx(x=0~2,5~7,19~20,60~63)
    \param[in]  int_flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH0: channel 0 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH1: channel 1 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH2: channel 2 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH3: channel 3 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_TRG: trigger interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_BRK: BREAK interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_DECJ: quadrature decoder signal jump interrupt flag, TIMERx(x=1~2)
      \arg        TIMER_FLAG_DECDIS: quadrature decoder signal disconnection interrupt flag, TIMERx(x=1~2)
      \arg        TIMER_FLAG_MCH0: multi mode channel 0 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH1: multi mode channel 1 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH2: multi mode channel 2 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH3: multi mode channel 3 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_CH0COMADD: channel 0 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH1COMADD: channel 1 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH2COMADD: channel 2 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_CH3COMADD: channel 3 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH0COMADD: multi mode channel 0 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH1COMADD: multi mode channel 1 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH2COMADD: multi mode channel 2 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_MCH3COMADD: multi mode channel 3 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_FLAG_UP0: update interrupt flag of timer channel 0, TIMERx(x=5~6)
      \arg        TIMER_FLAG_UP1: update interrupt flag of timer channel 1, TIMERx(x=5~6)
      \arg        TIMER_FLAG_UP2: update interrupt flag of timer channel 2, TIMERx(x=5~6)
      \arg        TIMER_FLAG_UP3: update interrupt flag of timer channel 3, TIMERx(x=5~6)
    \param[out] none
    \retval     none
*/
void timer_flag_clear(uint32_t timer_periph, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0080U), ERR_PERIPH);
    } else if(NOT_TIMER_FLAG(flag)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0080U), ERR_PARAM_INVALID);
    } else
#endif
    {
        TIMER_INTF(timer_periph) = (~(uint32_t)flag);
    }
}

/*!
    \brief      enable the TIMER interrupt (API_ID(0x0081U))
    \param[in]  timer_periph: TIMERx(x=0~2,5~7,19~20,60~63)
    \param[in]  interrupt: timer interrupt source
                only one parameter can be selected which are shown as below:
      \arg        TIMER_INT_UP: update interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH0: channel 0 capture or compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH1: channel 1 capture or compareinterrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH2: channel 2 capture or compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH3: channel 3 capture or compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CMT: channel commutation interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_TRG: trigger interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_BRK: break interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_DECJ: quadrature decoder signal jump interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_DECDIS: quadrature decoder signal disconnection interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_MCH0: multi mode channel 0 capture or compare interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_MCH1: multi mode channel 1 capture or compare interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_MCH2: multi mode channel 2 capture or compare interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_MCH3: multi mode channel 3 capture or compare interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_CH0COMADD: channel 0 additional compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH1COMADD: channel 1 additional compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH2COMADD: channel 2 additional compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH3COMADD: channel 3 additional compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_MCH0COMADD: multi mode channel 0 additional compare interrupt, TIMERx(0,7,19~20,60~63)
      \arg        TIMER_INT_MCH1COMADD: multi mode channel 1 additional compare interrupt, TIMERx(0,7,19~20,60~63)
      \arg        TIMER_INT_MCH2COMADD: multi mode channel 2 additional compare interrupt, TIMERx(0,7,19~20,60~63)
      \arg        TIMER_INT_MCH3COMADD: multi mode channel 3 additional compare interrupt, TIMERx(0,7,19~20,60~63)
      \arg        TIMER_INT_UP0: update interrupt of timer channel 0, TIMERx(x=5~6)
      \arg        TIMER_INT_UP1: update interrupt of timer channel 1, TIMERx(x=5~6)
      \arg        TIMER_INT_UP2: update interrupt of timer channel 2, TIMERx(x=5~6)
      \arg        TIMER_INT_UP3: update interrupt of timer channel 3, TIMERx(x=5~6)
    \param[out] none
    \retval     none
*/
void timer_interrupt_enable(uint32_t timer_periph, timer_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0081U), ERR_PERIPH);
    } else if(NOT_TIMER_INTERRUPT_FLAG(interrupt)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0081U), ERR_PARAM_INVALID);
    } else
#endif
    {
        TIMER_REG_VAL(timer_periph, interrupt) |= BIT(TIMER_BIT_POS(interrupt));
    }
}

/*!
    \brief      disable the TIMER interrupt (API_ID(0x0082U))
    \param[in]  timer_periph: TIMERx(x=0~2,5~7,19~20,60~63)
    \param[in]  interrupt: timer interrupt source
                only one parameter can be selected which are shown as below:
      \arg        TIMER_INT_UP: update interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH0: channel 0 capture or compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH1: channel 1 capture or compareinterrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH2: channel 2 capture or compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH3: channel 3 capture or compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CMT: channel commutation interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_TRG: trigger interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_BRK: break interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_DECJ: quadrature decoder signal jump interrupt, TIMERx(x=1~2)
      \arg        TIMER_INT_DECDIS: quadrature decoder signal disconnection interrupt, TIMERx(x=1~2)
      \arg        TIMER_INT_MCH0: multi mode channel 0 capture or compare interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_MCH1: multi mode channel 1 capture or compare interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_MCH2: multi mode channel 2 capture or compare interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_MCH3: multi mode channel 3 capture or compare interrupt, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_CH0COMADD: channel 0 additional compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH1COMADD: channel 1 additional compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH2COMADD: channel 2 additional compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_CH3COMADD: channel 3 additional compare interrupt, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_MCH0COMADD: multi mode channel 0 additional compare interrupt, TIMERx(0,7,19~20,60~63)
      \arg        TIMER_INT_MCH1COMADD: multi mode channel 1 additional compare interrupt, TIMERx(0,7,19~20,60~63)
      \arg        TIMER_INT_MCH2COMADD: multi mode channel 2 additional compare interrupt, TIMERx(0,7,19~20,60~63)
      \arg        TIMER_INT_MCH3COMADD: multi mode channel 3 additional compare interrupt, TIMERx(0,7,19~20,60~63)
      \arg        TIMER_INT_UP0: update interrupt of timer channel 0, TIMERx(x=5~6)
      \arg        TIMER_INT_UP1: update interrupt of timer channel 1, TIMERx(x=5~6)
      \arg        TIMER_INT_UP2: update interrupt of timer channel 2, TIMERx(x=5~6)
      \arg        TIMER_INT_UP3: update interrupt of timer channel 3, TIMERx(x=5~6)
    \param[out] none
    \retval     none
*/
void timer_interrupt_disable(uint32_t timer_periph, timer_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0082U), ERR_PERIPH);
    } else if(NOT_TIMER_INTERRUPT_FLAG(interrupt)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0082U), ERR_PARAM_INVALID);
    } else
#endif
    {
        TIMER_REG_VAL(timer_periph, interrupt) &= ~BIT(TIMER_BIT_POS(interrupt));  
    }
        
