sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.c
}

/*!
    \brief      get timer interrupt flags (API_ID(0x0083U))
    \param[in]  timer_periph: TIMERx(x=0~2,5~7,19~20,60~63)
    \param[in]  int_flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH0: channel 0 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH1: channel 1 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH2: channel 2 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH3: channel 3 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_BRK: BREAK interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_DECJ: quadrature decoder signal jump interrupt flag, TIMERx(x=1~2)
      \arg        TIMER_INT_FLAG_DECDIS: quadrature decoder signal disconnection interrupt flag, TIMERx(x=1~2)
      \arg        TIMER_INT_FLAG_MCH0: multi mode channel 0 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH1: multi mode channel 1 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH2: multi mode channel 2 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH3: multi mode channel 3 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH0COMADD: channel 0 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH1COMADD: channel 1 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH2COMADD: channel 2 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH3COMADD: channel 3 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH0COMADD: multi mode channel 0 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH1COMADD: multi mode channel 1 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH2COMADD: multi mode channel 2 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH3COMADD: multi mode channel 3 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_UP0: update interrupt flag of timer channel 0, TIMERx(x=5~6)
      \arg        TIMER_INT_FLAG_UP1: update interrupt flag of timer channel 1, TIMERx(x=5~6)
      \arg        TIMER_INT_FLAG_UP2: update interrupt flag of timer channel 2, TIMERx(x=5~6)
      \arg        TIMER_INT_FLAG_UP3: update interrupt flag of timer channel 3, TIMERx(x=5~6)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_interrupt_flag_get(uint32_t timer_periph, uint32_t int_flag)
{
    FlagStatus timer_interrupt_flag = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0083U), ERR_PERIPH);
    } else if(NOT_TIMER_INT_FLAG(int_flag)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0083U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if((uint32_t)RESET != (TIMER_INTF(timer_periph) & int_flag)){
            timer_interrupt_flag =  SET;
        } else {
            timer_interrupt_flag = RESET;
        }
    }
    return timer_interrupt_flag;
}

/*!
    \brief      clear TIMER interrupt flags (API_ID(0x0084U))
    \param[in]  timer_periph: TIMERx(x=0~2,5~7,19~20,60~63)
    \param[in]  int_flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH0: channel 0 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH1: channel 1 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH2: channel 2 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH3: channel 3 capture or compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_BRK: BREAK interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_DECJ: quadrature decoder signal jump interrupt flag, TIMERx(x=1~2)
      \arg        TIMER_INT_FLAG_DECDIS: quadrature decoder signal disconnection interrupt flag, TIMERx(x=1~2)
      \arg        TIMER_INT_FLAG_MCH0: multi mode channel 0 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH1: multi mode channel 1 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH2: multi mode channel 2 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH3: multi mode channel 3 capture or compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH0COMADD: channel 0 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH1COMADD: channel 1 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH2COMADD: channel 2 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_CH3COMADD: channel 3 additional compare interrupt flag, TIMERx(x=0~2,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH0COMADD: multi mode channel 0 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH1COMADD: multi mode channel 1 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH2COMADD: multi mode channel 2 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_MCH3COMADD: multi mode channel 3 additional compare interrupt flag, TIMERx(x=0,7,19~20,60~63)
      \arg        TIMER_INT_FLAG_UP0: update interrupt flag of timer channel 0, TIMERx(x=5~6)
      \arg        TIMER_INT_FLAG_UP1: update interrupt flag of timer channel 1, TIMERx(x=5~6)
      \arg        TIMER_INT_FLAG_UP2: update interrupt flag of timer channel 2, TIMERx(x=5~6)
      \arg        TIMER_INT_FLAG_UP3: update interrupt flag of timer channel 3, TIMERx(x=5~6)
    \param[out] none
    \retval     none
*/
void timer_interrupt_flag_clear(uint32_t timer_periph, uint32_t int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMER_PERIPH(timer_periph)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0084U), ERR_PERIPH);
    } else if(NOT_TIMER_INT_FLAG(int_flag)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0084U), ERR_PARAM_INVALID);
    } else
#endif
    {
        TIMER_INTF(timer_periph) = (~(uint32_t)int_flag);
    }
}
